{"test_questions": [[{"question": "You have your laptop directly connected into a router's Ethernet port. Which of the following are among the requirements for the copy flash tftp command to be successful?\n  TFTP server software must be running on the router.\n  TFTP server software must be running on your laptop.\n  The Ethernet cable connecting the laptop directly into the router's Ethernet port must be a straight-through cable.\n  The laptop must be on the same subnet as the router's Ethernet interface.\n  The copy flash tftp command must be supplied the IP address of the laptop.", "opta": "1, 3 and 4", "optb": "2, 4 and 5", "optc": "3 and 5 only", "optd": "5 only", "ans": "B", "explanation": "Before you back up an IOS image to a laptop directly connected to a router's Ethernet port, make sure the TFTP server software is running on your laptop, that the Ethernet cable is a \"crossover,\" and that the laptop is in the same subnet as the router's Ethernet port, and then you can use the copy flash tftp command from your laptop."}, {"question": "What information is displayed by the show hosts command?\n  Temporary DNS entries\n  The names of the routers created using the hostname command\n  The IP addresses of workstations allowed to access the router\n  Permanent name-to-address mappings created using the ip host command\n  The length of time a host has been connected to the router via Telnet", "opta": "1, 2 and 3", "optb": "1 and 4", "optc": "3, 4, and 5", "optd": "All of the above", "ans": "B", "explanation": "The show hosts command provides information on temporary DNS entries and permanent name-to-address mappings created using the ip host command."}, {"question": "You are unsuccessful in telnetting into a remote device. What could the problem be?\n  IP addresses are incorrect.\n  Access control list is filtering Telnet.\n  There is a defective serial cable.\n  The VTY password is missing.", "opta": "1 only", "optb": "3 only", "optc": "2 and 4 only", "optd": "All of the above", "ans": "C", "explanation": "The best answers, the ones you need to remember, are that either an access control list is filtering the Telnet session or the VTY password is not set on the remote device."}, {"question": "Which three commands can be used to check LAN connectivity problems on a router?\n show interfaces\n show ip route\n tracert\n ping\n dns lookups", "opta": "1 ,2 and 4", "optb": "2 and 5", "optc": "3 and 5", "optd": "None of the above", "ans": "A", "explanation": "The tracert command is a Windows command and will not work on a router! A router uses the traceroute command."}, {"question": "If you want to have more than one Telnet session open at the same time, what keystroke combination would you use?", "opta": "Tab+Spacebar", "optb": "Ctrl+X, then 6", "optc": "Ctrl+Shift+X, then 6", "optd": "Ctrl+Shift+6, then X", "ans": "D", "explanation": "To keep open one or more Telnet sessions, use the Ctrl+Shift+6 and then X keystroke combination."}, {"question": "Which command will copy the IOS to a backup host on your network?", "opta": "transfer IOS to 172.16.10.1", "optb": "copy run start", "optc": "copy start tftp", "optd": "copy flash tftp", "ans": "D", "explanation": "To copy the IOS to a backup host, which is stored in flash memory by default, use the copy flash tftp command."}, {"question": "Which command loads a new version of the Cisco IOS into a router?", "opta": "copy flash ftp", "optb": "copy ftp flash", "optc": "copy flash tftp", "optd": "copy tftp flash", "ans": "D", "explanation": "The command copy tftp flash will allow you to copy a new IOS into flash memory on your router."}, {"question": "You are troubleshooting a connectivity problem in your corporate network and want to isolate the problem. You suspect that a router on the route to an unreachable network is at fault. What IOS user exec command should you issue?", "opta": "Router> ping", "optb": "Router> trace", "optc": "Router> show ip route", "optd": "Router> show interface", "ans": "B", "explanation": "The command traceroute (trace for short), which can be issued from user mode or privileged mode, is used to find the path a packet takes through an internetwork and will also show you where the packet stops because of an error on a router."}, {"question": "The configuration register setting of 0x2102 provides what function to a router?", "opta": "Tells the router to boot into ROM monitor mode", "optb": "Provides password recovery", "optc": "Tells the router to look in NVRAM for the boot sequence", "optd": "Boots the IOS from a TFTP server", "ans": "C", "explanation": "The default configuration setting of 0x2102 tells the router to look in NVRAM for the boot sequence."}, {"question": "You telnet to a router and make your necessary changes; now you want to end the Telnet session. What command do you type in?", "opta": "close", "optb": "disable", "optc": "disconnect", "optd": "exit", "ans": "D", "explanation": "Since the question never mentioned anything about a suspended session, you can assume that the Telnet session is still open, and you would just type exit to close the session."}, {"question": "Which command displays the configuration register setting?", "opta": "show ip route", "optb": "show boot version", "optc": "show version", "optd": "show flash", "ans": "C", "explanation": "The show version command provides you with the current configuration register setting."}, {"question": "What should the configuration register value be after you successfully complete the password recovery procedure and return the router to normal operation?", "opta": "0x2100", "optb": "0x2101", "optc": "0x2102", "optd": "0x2142", "ans": "C", "explanation": "All Cisco routers have a default configuration register setting of 0x2102, which tells the router to load the IOS from flash memory and the configuration from NVRAM."}, {"question": "You telnet into a remote device and type debug ip rip, but no output from the debug command is seen. What could the problem be?", "opta": "You must type the show ip rip command first.", "optb": "IP addressing on the network is incorrect.", "optc": "You must use the terminal monitor command.", "optd": "Debug output is sent only to the console.", "ans": "C", "explanation": "To see console messages through your Telnet session, you must enter the terminal monitor command."}, {"question": "What does the command o/r 0x2142 provide?", "opta": "It is used to restart the router.", "optb": "It is used to bypass the configuration in NVRAM.", "optc": "It is used to enter ROM Monitor mode.", "optd": "It is used to view the lost password.", "ans": "B", "explanation": "The default configuration setting is 0x2102, which tells the router to load the IOS from flash and the configuration from NVRAM. 0x2142 tells the router to bypass the configuration in NVRAM so that you can perform password recovery."}, {"question": "You save the configuration on a router with the copy running-config startup-config command and reboot the router. The router, however, comes up with a blank configuration. What can the problem be?", "opta": "You didn't boot the router with the correct command.", "optb": "NVRAM is corrupted.", "optc": "The configuration register setting is incorrect.", "optd": "The newly upgraded IOS is not compatible with the hardware of the router.", "ans": "C", "explanation": "If you save a configuration and reload the router and it comes up either in setup mode or as a blank configuration, chances are you have the configuration register setting incorrect."}, {"question": "The corporate office sends you a new router to connect, but upon connecting the console cable, you see that there is already a configuration on the router. What should be done before a new configuration is entered in the router?", "opta": "RAM should be erased and the router restarted.", "optb": "Flash should be erased and the router restarted.", "optc": "NVRAM should be erased and the router restarted.", "optd": "The new configuration should be entered and saved.", "ans": "C", "explanation": "Before you start to configure the router, you should erase the NVRAM with the erase startup-config command and then reload the router using the reload command."}, {"question": "Which command will show you the IOS version running on your router?", "opta": "sh IOS", "optb": "sh flash", "optc": "sh version", "optd": "sh running-config", "ans": "C", "explanation": "The best answer is show version, which shows you the IOS file running currently on your router. The show flash command shows you the contents of flash memory, not which file is running."}, {"question": "You need to gather the IP address of a remote switch that is located in Hawaii. What can you do to find the address?", "opta": "Issue the show ip arp command on the router connected to the switch.", "optb": "Issue the show ip route command on the router connected to the switch.", "optc": "Issue the show cdp neighbor command on the router connected to the switch.", "optd": "Issue the show cdp neighbors detail command on the router connected to the switch.", "ans": "D", "explanation": "Although option A is certainly the \"best\" answer, unfortunately option  D will work just fine and your boss would probably prefer you to use the show cdp neighbors detail command."}, {"question": "A network administrator wants to upgrade the IOS of a router without removing the image currently installed. What command will display the amount of memory consumed by the current IOS image and indicate whether there is enough room available to hold both the current and new images?", "opta": "show version", "optb": "show flash", "optc": "show memory", "optd": "show buffers", "ans": "B", "explanation": "The show flash command will provide you with the current IOS name and size and the size of flash memory."}, {"question": "You copy a configuration from a network host to a router's RAM. The configuration looks correct, yet it is not working at all. What could the problem be?", "opta": "You copied the wrong configuration into RAM.", "optb": "You copied the configuration into flash memory instead.", "optc": "The copy did not override the shutdown command in running-config.", "optd": "The IOS became corrupted after the copy command was initiated.", "ans": "C", "explanation": "Since the configuration looks correct, you probably didn't screw up the copy job. However, when you perform a copy from a network host to a router, the interfaces are automatically shut down and need to be manually enabled with the no shutdown command."}]]}