{"test_questions": [[{"question": "Which command would you place on interface connected to the Internet?", "opta": "ip nat inside", "optb": "ip nat outside", "optc": "ip outside global", "optd": "ip inside local", "ans": "B", "explanation": "As in access-lists, you must configure your interfaces before NAT will provide any translations. On the inside networks you would use the command ip nat inside. On the outside interface, you will use the command ip nat outside."}, {"question": "Which command will show you all the translations active on your router?", "opta": "show ip nat translations", "optb": "show ip nat statistics", "optc": "debug ip nat", "optd": "clear ip nat translations *", "ans": "A", "explanation": "The command show ip nat translations will show you the translation table containing all the active NAT entries."}, {"question": "Which command would you place on interface on a private network?", "opta": "ip nat inside", "optb": "ip nat outside", "optc": "ip outside global", "optd": "ip inside local", "ans": "A", "explanation": "As in access-lists, you must configure your interfaces before NAT will provide any translations. On the inside networks you would use the command ip nat inside. On the outside interface, you will use the command ip nat outside."}, {"question": "Port Address Translation is also termed what?", "opta": "NAT Fast", "optb": "NAT Static", "optc": "NAT Overload", "optd": "Overloading Static", "ans": "C", "explanation": "Another term for port address translation is NAT Overload because that is the command used to enable port address translation."}, {"question": "When creating a pool of global addresses, which of the following can be used instead of the netmask command?", "opta": "/ (slash notation)", "optb": "prefix-length", "optc": "no mask", "optd": "block-size", "ans": "B", "explanation": "Instead of the netmask command, you can use the prefix-length <length> statement."}, {"question": "Which of the following would be a good starting point for troubleshooting if your router is not translating?", "opta": "Reboot.", "optb": "Call Cisco.", "optc": "Check your interfaces for the correct configuration.", "optd": "Run the debug all command.", "ans": "C", "explanation": "In order for NAT to provide translation services, you must have ip nat inside and ip nat outside configured on your router's interfaces."}, {"question": "Which command will show you the summary of the NAT configuration?", "opta": "show ip nat translations", "optb": "show ip nat statistics", "optc": "debug ip nat", "optd": "clear ip nat translations *", "ans": "B", "explanation": "The show ip nat statistics command displays a summary of the NAT configuration as well as counts of active translation types, hits to an existing mapping, misses (causing an attempt to create a mapping), and expired translations."}, {"question": "Which of the following is considered to be the destination host before translation?", "opta": "Inside local", "optb": "Outside local", "optc": "Inside global", "optd": "Outside global", "ans": "B", "explanation": "The host on the global network before translation is considered to be an outside local host."}, {"question": "Which of the following is considered to be the address after translation?", "opta": "Inside local", "optb": "Outside local", "optc": "Inside global", "optd": "Outside global", "ans": "C", "explanation": "The host on the private network after translation is considered to be an inside global host."}, {"question": "Which are considered the methods of NAT?\n  Static\n  IP NAT pool\n  Dynamic\n  NAT double-translation\n  Overload", "opta": "1 and 6", "optb": "3 only", "optc": "1, 3 and 5", "optd": "All of the above", "ans": "C", "explanation": "You can configure NAT three ways on a Cisco router: static, dynamic, and NAT Overload (PAT)."}, {"question": "Which command will allow you to see real-time translations on your router?", "opta": "show ip nat translations", "optb": "show ip nat statistics", "optc": "debug ip nat", "optd": "clear ip nat translations *", "ans": "C", "explanation": "The command debug ip nat will show you in real time the translations occurring on your router."}, {"question": "Which of the following would be good reasons to run NAT?\n  You need to connect to the Internet and your hosts don't have globally unique IP addresses.\n  You change to a new ISP that requires you to renumber your network.\n  You don't want any hosts connecting to the Internet.\n  You require two intranets with duplicate addresses to merge.", "opta": "1, 2 and 4", "optb": "2 and 4", "optc": "3 only", "optd": "All of the above", "ans": "A", "explanation": "The most popular use of NAT is if you want to connect to the Internet and you don't want hosts to have global (real) IP addresses, but option B and D are correct as well."}, {"question": "Which of the following are advantages of using NAT?\n  Translation introduces switching path delays.\n  Conserves legally registered addresses.\n  Causes loss of end-to-end IP traceability.\n  Increases flexibility when connecting to the Internet.\n  Certain applications will not function with NAT enabled.\n  Reduces address overlap occurrence.", "opta": "1, 3 and 4", "optb": "3, 5 and 6", "optc": "5 and 6", "optd": "2, 4 and 6", "ans": "D", "explanation": "NAT is not perfect, but there are some advantages. It conserves global addresses, which allow us to add millions of hosts to the Internet without \"real\" IP addresses. This provides flexibility in our corporate networks. NAT can also allow you to use the same subnet more than once in the same network without overlapping networks."}, {"question": "Which of the following is considered to be the address before translation?", "opta": "Inside local", "optb": "Outside local", "optc": "Inside global", "optd": "Outside global", "ans": "A", "explanation": "The host on the private network before translation is considered to be an inside local host."}, {"question": "Which of the following are disadvantages of using NAT?\n  Translation introduces switching path delays.\n  Conserves legally registered addresses.\n  Causes loss of end-to-end IP traceability.\n  Increases flexibility when connecting to the Internet.\n  Certain applications will not function with NAT enabled.\n  Reduces address overlap occurrence.", "opta": "1, 3 and 5", "optb": "3 and 4", "optc": "2, 4 and 5", "optd": "1 and 3", "ans": "A", "explanation": "NAT is not perfect and can cause some issues in some networks, but most networks work just fine. NAT can cause delays and troubleshooting problems, and some applications just won't work."}, {"question": "Which of the following is considered to be the destination host after translation?", "opta": "Inside local", "optb": "Outside local", "optc": "Inside global", "optd": "Outside global", "ans": "D", "explanation": "The host on the global network after translation is considered to be an outside global host."}, {"question": "Which command will create a dynamic pool named Todd that will provide you with 30 global addresses?", "opta": "ip nat pool Todd 171.16.10.65 171.16.10.94 net 255.255.255.240", "optb": "ip nat pool Todd 171.16.10.65 171.16.10.94 net 255.255.255.224", "optc": "ip nat pool todd 171.16.10.65 171.16.10.94 net 255.255.255.224", "optd": "ip nat pool Todd 171.16.10.1 171.16.10.254 net 255.255.255.0", "ans": "B", "explanation": "The command ip nat pool <name> creates the pool that hosts can use to get onto the global Internet. What makes option B correct is that the range 171.16.10.65 through 171.16.10.94 includes 30 hosts, but the mask has to match 30 hosts as well, and that mask is 255.255.255.224. Option C is wrong because the pool name has a lower case \"T\" in the pool name. Pool name's are case sensitive."}, {"question": "Which command will clear all the translations active on your router?", "opta": "show ip nat translations", "optb": "show ip nat statistics", "optc": "debug ip nat", "optd": "clear ip nat translations *", "ans": "D", "explanation": "The command clear ip nat translations * will clear all the active NAT entries in your translation table."}]]}