{"test_questions": [[{"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "D", "explanation": "In fig. (X), one of the dots lies in the region common to the circle and the square only and the other dot lies in the region common to all the three figures -the circle, the square and the triangle. In each of the alternatives (1), (2) and (3), there is no region common to the square and the circle only. Only fig. (4) consists of both the types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "D", "explanation": "In fig. (X), one of the dots lies in the region common to the circle and the square only, another dot lies in the region common to the square, the triangle and the rectangle only and the third dot lies in the region common to the triangle and the rectangle only. In each of the figures (1), (2) and (3) there is no region common to the square, the triangle and the rectangle only. Only fig. (4) consists of all the three types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "C", "explanation": "In fig. (X), the dot is contained in the region common to the triangle and the circle only. Out of the four alternatives, only fig. (3) contains a region common to the triangle and the circle only."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "A", "explanation": "In fig. (X), one of the dots lies in the region common to the circle and the square only, another dot lies in the region common to the square, the triangle and the rectangle only and the third dot lies in the region common to the square and the rectangle only. In fig. (2) there is no region common to the square and the rectangle only, in fig. (3) there is no region common to the circle and the square only and in fig. (4) there is no region common to the square, the triangle and the rectangle only. Only fig. (1) consists of all the three types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "B", "explanation": "In fig. (X), one of the dots lies in the region common to the circle and the triangle only, another dot lies in the region common to the circle, the square and the triangle only and the third dot lies in the region common to the circle, the square and the rectangle only. In each of the figures (1) and (3) there is no region common to the circle and the triangle only. In fig. (4) there is no region common to the circle, the square and the rectangle only. Only fig. (2) consists of all the three types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "A", "explanation": "In fig. (X), the dot is contained in the region common to the triangle and the square only. Out of the four alternatives, only fig. (1) contains a region common to the triangle and the square only."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "D", "explanation": "In fig. (X), the dot is contained in the region common to the square and the circle only. Out of the four alternatives, only fig. (4) contains a region common to the square and the circle only."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "C", "explanation": "In fig. (X), one of the dots lies in the region common to the circle and the triangle only and the other dot lies in the circle alone. In each of the two figures (1) and (2), there is no region common to the circle and the triangle only. In fig. (4) there is no region which lies in the circle alone. Only fig. (3) consists of both the types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "D", "explanation": "In fig. (X), one of the dots lies in the region common to the circle and the triangle only, another dot lies in the region common to all the three figures - the circle, the square and the triangle and the third dot lies in the region common to the circle and the square only. In each of the figures (1) and (3), there is no region common to the circle and the square only and in fig. (2), there is no region common to the circle and the triangle only. Only fig. (4) consists of all the three types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "A", "explanation": "In fig. (X), one of the dots is placed in the region common to the circle and the triangle only and another dot is placed in the region common to the square and the triangle only. In each of the three alternatives (2), (3) and (4), there is no region common to the square and the triangle only. Only fig. (1) consists of both the types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "A", "explanation": "In fig. (X), one of the dots lies in the region common to the square and the rectangle only, another dot lies in the region common to all the four elements - the circle, the square, the triangle and the rectangle and the third dot lies in the region common to the triangle and the rectangle only. In fig. (2) there is no region common to the triangle and the rectangle only. In fig. (3) there is no region common to the square and the rectangle only. In fig. (4) there is no region common to all the four elements - the circle, the square, the triangle and the rectangle. Only fig. (1) consists of all the three types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "C", "explanation": "In fig. (X), one of the dots lies in the region common to the circle the triangle and the rectangle only, another dot lies in the region common to the circle and the triangle only and the third dot lies in the region common to the circle, the square and the triangle only. In each of the figures (1), (2) and (4) there is no region common to the circle, the triangle and the rectangle only. Only fig. (3) consists of all the three types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "A", "explanation": "In fig. (X), one of the dots lies in the region common to the circle and the triangle only and the other dot lies in the region common to the square and the triangle only. In each of the figures (2), (3) and (4), there is no region common to the circle and the triangle only. Only fig. (1) consists of both the types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "B", "explanation": "In fig. (X), one of the dots lies in the region common to the circle and the square only, another dot lies in the region common to all the three figures - the circle, the square and the triangle and the third dot lies in the region common to the circle and the triangle only. In each of the alternatives (1), (3) and (4), there is no region common to the circle and the triangle only. Only fig. (2) consists of all the three types of regions."}, {"question": "Select the figure which satisfies the same conditions of placement of the dots as in Figure-X.", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "D", "explanation": "In fig. (X), one of the dots lies in the region common to the square and the triangle only and the other dot lies in the region common to all the three figures - the circle, the square and the triangle. In each of the alternatives (1) and (2), there is no region common to the square and the triangle only. In alternative (3), there is no region common to all the three figures. Only, alternative (4) consists of both the types of regions."}]]}