{"test_questions": [[{"question": "public void foo( boolean a, boolean b)\n{ \n    if( a ) \n    {\n        System.out.println(\"A\"); /* Line 5 */\n    } \n    else if(a && b) /* Line 7 */\n    { \n        System.out.println( \"A && B\"); \n    } \n    else /* Line 11 */\n    { \n        if ( !b ) \n        {\n            System.out.println( \"notB\") ;\n        } \n        else \n        {\n            System.out.println( \"ELSE\" ) ; \n        } \n    } \n}", "opta": "If a is true and b is true then the output is \"A && B\"", "optb": "If a is true and b is false then the output is \"notB\"", "optc": "If a is false and b is true then the output is \"ELSE\"", "optd": "If a is false and b is false then the output is \"ELSE\"", "ans": "C", "explanation": "Option C is correct. The output is \"ELSE\". Only when a is false do the output lines after 11 get some chance of executing.\nOption A is wrong. The output is \"A\". When a is true, irrespective of the value of b, only the line 5 output will be executed. The condition at line 7 will never be evaluated (when a is true it will always be trapped by the line 12 condition) therefore the output will never be \"A && B\". \nOption B is wrong. The output is \"A\". When a is true, irrespective of the value of b, only the line 5 output will be executed. \nOption D is wrong. The output is \"notB\"."}, {"question": "switch(x) \n{ \n    default:  \n        System.out.println(\"Hello\"); \n}\n\nWhich two are acceptable types for x?\n\nbyte\nlong\nchar\nfloat\nShort\nLong", "opta": "1 and 3", "optb": "2 and 4", "optc": "3 and 5", "optd": "4 and 6", "ans": "A", "explanation": "Switch statements are based on integer expressions and since both bytes and chars can implicitly be widened to an integer, these can also be used. Also shorts can be used. Short and Long are wrapper classes and reference types can not be used as variables."}, {"question": "public void test(int x) \n{ \n    int odd = 1; \n    if(odd) /* Line 4 */\n    {\n        System.out.println(\"odd\"); \n    } \n    else \n    {\n        System.out.println(\"even\"); \n    } \n}\n\nWhich statement is true?", "opta": "Compilation fails.", "optb": "\"odd\" will always be output.", "optc": "\"even\" will always be output.", "optd": "\"odd\" will be output for odd values of x, and \"even\" for even values.", "ans": "A", "explanation": "The compiler will complain because of incompatible types (line 4), the if expects a boolean but it gets an integer."}, {"question": "public class While \n{\n    public void loop() \n    {\n        int x= 0;\n        while ( 1 ) /* Line 6 */\n        {\n            System.out.print(\"x plus one is \" + (x + 1)); /* Line 8 */\n        }\n    }\n}\n\nWhich statement is true?", "opta": "There is a syntax error on line 1.", "optb": "There are syntax errors on lines 1 and 6.", "optc": "There are syntax errors on lines 1, 6, and 8.", "optd": "There is a syntax error on line 6.", "ans": "D", "explanation": "Using the integer 1 in the while statement, or any other looping or conditional construct for that matter, will result in a compiler error. This is old C Program syntax, not valid Java.\nA, B and C are incorrect because line 1 is valid (Java is case sensitive so While is a valid class name). Line 8 is also valid because an equation may be placed in a String operation as shown."}]]}