{"test_questions": [[{"question": "At room temperature the current in an intrinsic semiconductor is due to", "opta": "holes", "optb": "electrons", "optc": "ions", "optd": "holes and electrons", "ans": "D", "explanation": "Intrinsic material has equal number of holes and electrons."}, {"question": "Work function is the maximum energy required by the fastest electron at 0 K to escape from the metal surface.", "opta": "True", "optb": "False", "ans": "B", "explanation": "Work function is the minimum energy required by the fastest electron at 0 K to escape from the metal surface."}, {"question": "The most commonly used semiconductor material is", "opta": "silicon", "optb": "germanium", "optc": "mixture of silicon and germanium", "optd": "none of the above", "ans": "A", "explanation": "Germanium is rarely used."}, {"question": "In which of these is reverse recovery time nearly zero?", "opta": "Zener diode", "optb": "Tunnel diode", "optc": "Schottky diode", "optd": "PIN diode", "ans": "C", "explanation": "In schottky diode there is no charge storage and hence almost zero reverse recovery time."}, {"question": "A transistor has a current gain of 0.99 in the CB mode. Its current gain in the CC mode is", "opta": "100", "optb": "99", "optc": "1.01", "optd": "0.99", "ans": "A", "explanation": "Current gain = 1 + β = 100."}, {"question": "In p-n-p transistor the current IE has two components viz. IEP due to injection of holes from p-region to n-region and IE due to injection of electrons from n-region to p-region. Then", "opta": "IEp and IEn are almost equal", "optb": "IEp >> IEn", "optc": "IEn >> IEp", "optd": "either (a) or (c)", "ans": "B", "explanation": "Emitter is p-type in p-n-p transistor. \n\nTherefore holes are majority carriers."}, {"question": "In an n channel JFET, the gate is", "opta": "n type", "optb": "p type", "optc": "either n or p", "optd": "partially n & partially p", "ans": "B", "explanation": "Since channel is n type gate must be p type."}, {"question": "The amount of photoelectric emission current depends on", "opta": "frequency of incident radiation", "optb": "intensity of incident radiation", "optc": "both frequency and intensity of incident radiation", "optd": "none of the above", "ans": "B", "explanation": "Only the intensity of incident radiation governs the amount of photoelectric emission."}, {"question": "Assertion (A):  A p-n junction has high resistance in reverse direction.\nReason (R):  When a reverse bias is applied to p-n junction, the width of depletion layer increases.", "opta": "Both A and R are true and R is correct explanation of A", "optb": "Both A and R are true but R is not a correct explanation of A", "optc": "A is true but R is false", "optd": "A is false but R is true", "ans": "A", "explanation": "The increase in reverse resistance is due to widening of depletion layer."}, {"question": "In the circuit of figure the function of resistor R and diode D are", "opta": "to limit the current and to protect LED against over voltage", "optb": "to limit the voltage and to protect LED against over current", "optc": "to limit the current and protect LED against reverse breakdown voltage.", "optd": "none of the above.", "ans": "C", "explanation": "Resistance limits current and diode is reverse connected and therefore protects LED against reverse breakdown."}, {"question": "At very high temperatures the extrinsic semi conductors become intrinsic because", "opta": "drive in diffusion of dopants and carriers", "optb": "band to band transition dominants over impurity ionization", "optc": "impurity ionization dominants over band to band transition", "optd": "band to band transition is balanced by impurity ionization", "ans": "B", "explanation": "Covalent bonds are broken."}, {"question": "When a voltage is applied to a semiconductor crystal then the free electrons will flow.", "opta": "towards positive terminal", "optb": "towards negative terminal", "optc": "either towards positive terminal or negative terminal", "optd": "towards positive terminal for 1 μs and towards negative terminal for next 1 μs", "ans": "A", "explanation": "Since electrons are negatively charged they will flow towards positive terminal."}, {"question": "Ferrite have", "opta": "low copper loss", "optb": "low eddy current loss", "optc": "low resistivity", "optd": "higher specific gravity compared to iron", "ans": "C", "explanation": "Ferrite is a low density material of composition with Fe2O3 x O, where x is a bivalent metal, such as Cobart, Ni, Mn. These magnetic materials having very low loss of current and used in high frequency circuit."}, {"question": "In a p type material the Fermi level is 0.3 eV above valence band. The concentration of acceptor atoms is increased. The new position of Fermi level is likely to be", "opta": "0.5 eV above valence band", "optb": "0.28 eV above valence band", "optc": "0.1 eV above valence band", "optd": "below the valence band", "ans": "B", "explanation": "Addition of acceptor atom brings Fermi level closer to valence band."}, {"question": "In an n-p-n transistor, the majority carriers in the base are", "opta": "electrons", "optb": "holes", "optc": "both holes and electrons", "optd": "either holes or electrons", "ans": "A", "explanation": "Emitter is n type and emits electrons which diffuse through the base."}, {"question": "An LED has a rating of 2 V and 10 mA. It is used along with 6V battery. The range of series resistance is", "opta": "0 to 200 &ohm;", "optb": "200 - 400 &ohm;", "optc": "200 &ohm; and above", "optd": "400 &ohm; and above", "ans": "D", "explanation": "R =  = 400&ohm;. \n\nR must be at least 400&ohm; so that current in LED does not exceed 10 mA."}, {"question": "The number of doped regions in PIN diode is", "opta": "1", "optb": "2", "optc": "3", "optd": "1 or 2", "ans": "B", "explanation": "A PIN diode has p and n doped regions separated by intrinsic layer."}, {"question": "A transistor has two p-n junctions. The batteries should be connected such that", "opta": "both junctions are forward biased", "optb": "both junctions are reverse biased", "optc": "one junction is forward biased and the other is reverse biased", "optd": "none of the above", "ans": "C", "explanation": "Emitter-base junction is forward biased and base collector junction is reverse biased."}, {"question": "A silicon (PN) junction at a temperature of 20°C has a reverse saturation current of 10 pico Ampere. The reverse saturation current at 40°C for the same bias is approximately.", "opta": "30 pA", "optb": "40 pA", "optc": "50 pA", "optd": "60 pA", "ans": "B", "explanation": "By increasing of temperature by 10°C, Io become double so by increasing temperature 20°C, Io become 4 time than initial value... and it is 40 PA."}, {"question": "In a bipolar transistor the barrier potential", "opta": "0", "optb": "a total of 0.7 V", "optc": "0.7 V across each depletion layer", "optd": "0.35 V", "ans": "C", "explanation": "Since there are two p-n junctions, there are two depletion layers and 0.7 V across each layer."}, {"question": "Recombination produces new electron-hole pairs", "opta": "True", "optb": "False", "ans": "B", "explanation": "Due to recombination the number of electron-hole pairs is reduced."}, {"question": "An amplifier without feedback has a voltage gain of 50, input resistance of 1 k&ohm; and output resistance of 2.5 k&ohm;. The input resistance of the current shunt -ve feedback amplifier using the above amplifier with a feedback factor of 0.2 is", "opta": "1/11 k&ohm;", "optb": "1/5 k&ohm;", "optc": "5 kW", "optd": "11 kW", "ans": "A", "explanation": "Input Resistance with feedback for current shunt, ."}, {"question": "As compared to an ordinary semiconductor diode, a Schottky diode", "opta": "has lower cut in voltage", "optb": "has higher cut in voltage", "optc": "lower reverse saturation current", "optd": "both (b) and (c)", "ans": "A", "explanation": "Cut in voltage in Schottky diode is about 0.3 V as compared to 0.7 V in ordinary semiconductor diode."}, {"question": "Assertion (A):  When a high reverse voltage is applied to a p-n junction the diode breaks down. \nReason (R):  High reverse voltage causes Avalanche effect.", "opta": "Both A and R are true and R is correct explanation of A", "optb": "Both A and R are true but R is not a correct explanation of A", "optc": "A is true but R is false", "optd": "A is false but R is true", "ans": "A", "explanation": "Avalanche breakdown occurs at high reverse voltage."}, {"question": "As compared to an ordinary semiconductor diode, a Schottky diode", "opta": "has higher reverse saturation current", "optb": "has higher reverse saturation current and higher cut in voltage", "optc": "has higher reverse saturation current and lower cut in voltage", "optd": "has lower reverse saturation current and lower cut in voltage", "ans": "C", "explanation": "This is due to high electron concentration in metals."}, {"question": "Crossover distortion behaviour is characteristic of", "opta": "class A O/P stage", "optb": "class B O/P stage", "optc": "class AB output stage", "optd": "common pulse O/P state", "ans": "B", "explanation": "It is a characteristics of class B output stage as the amplifier is biased in cut-off region.\n\nIn class B amplifier, two transistor are operated in such a way that one is amplify the half cycle and second is amplify -ve half cycle."}, {"question": "If aac for transistor is 0.98 then βac is equal to", "opta": "51", "optb": "49", "optc": "47", "optd": "45", "ans": "B", "explanation": "."}, {"question": "Assertion (A):  The conductivity of p type semiconductor is higher than that of intrinsic semiconductor.\nReason (R):  The addition of donor impurity creates additional energy levels below conduction band.", "opta": "Both A and R are true and R is correct explanation of A", "optb": "Both A and R are true but R is not a correct explanation of A", "optc": "A is true but R is false", "optd": "A is false but R is true", "ans": "B", "explanation": "A refers to type semiconductor while R refers to n type semiconductor. Both A and R are correct but independent."}, {"question": "In an n-p-n transistor biased for operation in forward active region", "opta": "emitter is positive with respect to base", "optb": "collector is positive with respect to base", "optc": "base is positive with respect to emitter and collector is positive with respect to base", "optd": "none of the above", "ans": "C", "explanation": "In forward active mode emitter base junction is forward biased and base collector junction is reverse biased."}, {"question": "An increase in temperature increases the width of depletion layer.", "opta": "True", "optb": "False", "ans": "B", "explanation": "With increase in temperature width of depletion layer decreases."}, {"question": "A zener diode is used in", "opta": "voltage regulator circuit", "optb": "amplifier circuits", "optc": "both voltage regulator and amplifier circuit", "optd": "none of the above", "ans": "A", "explanation": "Zener diode is used only in voltage regulator circuits."}, {"question": "A particular green LED emits light of wavelength 5490, Å, the energy bandgap of the semiconductor material used there is .. h = 6.6 x 10-34 J sec.", "opta": "2.26 eV", "optb": "1.98 eV", "optc": "1.17 eV", "optd": "0.74 eV", "ans": "A", "explanation": "From Plank equation  joule \n\nto convert it into electron volt it will be divided by 1.6 x 10-19."}, {"question": "In a zener diode", "opta": "the forward current is very high", "optb": "sharp breakdown occurs at a certain reverse voltage", "optc": "the ratio v-i can be negative", "optd": "there are two p-n junctions", "ans": "B", "explanation": "When reverse voltage equals breakdown value it starts conducting and voltage does not increase further."}, {"question": "In a bipolar transistor which current is largest", "opta": "collector current", "optb": "base current", "optc": "emitter current", "optd": "base current or emitter current", "ans": "C", "explanation": "Emitter current is larger, collector current is slightly less than emitter current and base current is very small."}, {"question": "The v-i characteristics of a FET is shown in figure. In which region is the device biased for small signal amplification", "opta": "AB", "optb": "BC", "optc": "CD", "optd": "BD", "ans": "B", "explanation": "Small signal amplifier operation is in constant current region of characteristics."}, {"question": "Secondary emission is always decremental.", "opta": "True", "optb": "False", "ans": "B", "explanation": "Sometimes it can be useful also."}, {"question": "In a degenerate n type semiconductor material, the Fermi level,", "opta": "is in valence band", "optb": "is in conduction band", "optc": "is at the centre in between valence and conduction bands", "optd": "is very near valence band", "ans": "B", "explanation": "This is due to high level of doping."}, {"question": "The types of carriers in a semiconductor are", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "B", "explanation": "Holes and electrons."}, {"question": "A potential of 7 V is applied to a silicon diode. A resistance of 1 K ohm is also in series with the diode. The current is", "opta": "7 mA", "optb": "6.3 mA", "optc": "0.7 mA", "optd": "0", "ans": "B", "explanation": ""}, {"question": "Assertion (A):  The reverse saturation current in a semiconductor diode is 4nA at 20°C and 32 nA at 50°C.\nReason (R):  The reverse saturation current in a semiconductor diode doubles for every 10°C rise in temperature.", "opta": "Both A and R are true and R is correct explanation of A", "optb": "Both A and R are true but R is not a correct explanation of A", "optc": "A is true but R is false", "optd": "A is false but R is true", "ans": "A", "explanation": "At 20°C, 4 nA, at 30°C, 8 nA, at 40°C, 16 nA, at 50°C, 32 nA."}, {"question": "Calculate the stability factor and change in IC from 25°C to 100°C for, β = 50, RB/ RE = 250, ΔIC0 = 19.9 nA for emitter bias configuration.", "opta": "42.53, 0.85 μA", "optb": "40.91, 0.58 μA", "optc": "40.91, 0.58 μA", "optd": "41.10, 0.39 μA", "ans": "A", "explanation": "SICO = (1 + β).\n\n 51. = 42.53\n\nΔIC = (SICO).ΔICO\n\n= 42.53 x 19.9 nA\n\n= 0.85 μA."}, {"question": "A periodic voltage has following value for equal time intervals changing suddenly from one value to next... 0, 5, 10, 20, 50, 60, 50, 20, 10, 5, 0, -5, -10 etc. Then rms value of the waveform is", "opta": "31 V", "optb": "32 V", "optc": "insufficient data", "optd": "none of these", "ans": "A", "explanation": "RMS value = 965 = 31.064 Volt."}, {"question": "Work function of oxide coated cathode is much lower than that of tungsten cathode.", "opta": "True", "optb": "False", "ans": "A", "explanation": "Therefore emission current from oxide coated cathode is more."}, {"question": "The word enhancement mode is associated with", "opta": "tunnel diode", "optb": "MOSFET", "optc": "JFET", "optd": "photo diode", "ans": "B", "explanation": "MOSFET may be depletion mode or enhancement mode."}, {"question": "In which region of a CE bipolar transistor is collector current almost constant?", "opta": "Saturation region", "optb": "Active region", "optc": "Breakdown region", "optd": "Both saturation and active region", "ans": "B", "explanation": "It is used as amplifier when it operates in this region."}, {"question": "A p-n junction diode has", "opta": "low forward and high reverse resistance", "optb": "a non-linear v-i characteristics", "optc": "zero forward current till the forward voltage reaches cut in value", "optd": "all of the above", "ans": "D", "explanation": "A p-n Junction has all these features."}, {"question": "Which of the following is true as regards photo emission?", "opta": "Velocity of emitted electrons is dependent on light intensity", "optb": "Rate of photo emission is inversely proportional to light intensity", "optc": "Maximum velocity of electron increases with decreasing wave length", "optd": "Both holes and electrons are produced", "ans": "C", "explanation": "As wavelength decreases, frequency increases and maximum velocity of electron increases."}, {"question": "The power dissipation in a transistor is the product of", "opta": "emitter current and emitter to base voltage", "optb": "emitter current and collector to emitter voltage", "optc": "collector current and collector to emitter voltage", "optd": "none of the above", "ans": "C", "explanation": "Maximum power dissipation occurs at collector junction."}, {"question": "The normal operation of JFET is", "opta": "constant voltage region", "optb": "constant current region", "optc": "both constant voltage and constant current regions", "optd": "either constant voltage or constant current region", "ans": "B", "explanation": "In major portion of drain characteristics ID is constant."}, {"question": "The minority carrier life time and diffusion constant in a semiconductor material are respectively 100 microsecond and 100 cm2/sec. The diffusion length is", "opta": "0.1 cm", "optb": "0.01 cm", "optc": "0.0141 cm", "optd": "1 cm", "ans": "A", "explanation": "Diffusion length = ."}]]}