{"test_questions": [[{"question": "Which symbol will be on the face opposite to the face with symbol * ?", "opta": "@", "optb": "$", "optc": "8", "optd": "+", "ans": "C", "explanation": "The symbols of the adjacent faces to the face with symbol * are @, -, + and $. Hence the required symbol is 8."}, {"question": "Two positions of dice are shown below. How many points will appear on the opposite to the face containing 5 points?", "opta": "3", "optb": "1", "optc": "2", "optd": "4", "ans": "D", "explanation": "In these two positions one of the common face having 1 point is in the same position. Therefore according to rule (2). There will be 4 points on the required face."}, {"question": "Which digit will appear on the face opposite to the face with number 4?", "opta": "3", "optb": "5", "optc": "6", "optd": "2/3", "ans": "A", "explanation": "Here the common faces with number 3, are in same positions. Hence 6 is opposite to 2 and 5 is opposite to 1. Therefore 4 is opposite to 3."}, {"question": "Two positions of a dice are shown below. Which number will appear on the face opposite to the face with the number 5?", "opta": "2/6", "optb": "2", "optc": "6", "optd": "4", "ans": "C", "explanation": "According to the rule no. (3), common faces with number 3, are in same positions. Hence the number of the opposite face to face with number 5 will be 6."}, {"question": "How many points will be on the face opposite to in face which contains 2 points?", "opta": "1", "optb": "5", "optc": "4", "optd": "6", "ans": "D", "explanation": "In first two positions of dice one common face containing 5 is same. Therefore according to rule no. (3) the face opposite to the face which contains 2 point, will contains 6 points."}, {"question": "Which number is on the face opposite to 6?", "opta": "4", "optb": "1", "optc": "2", "optd": "3", "ans": "B", "explanation": "As the numbers 2, 3, 4 and 5 are adjacent to 6. Hence the number on the face opposite to 6 is 1."}, {"question": "Two positions of a dice are shown below. When number '1' is on the top. What number will be at the bottom?", "opta": "3", "optb": "5", "optc": "2", "optd": "6", "ans": "B", "explanation": "According to the rule (2) when 'one' is at the top, then 5 will be at the bottom."}, {"question": "Two positions of a cube with its surfaces numbered are shown below. When the surface 4 touch the bottom, what surface will be on the top?", "opta": "1", "optb": "2", "optc": "5", "optd": "6", "ans": "A", "explanation": "In these 2 positions one common face with number 1 is in the same position. Hence according to the rule number (3), 2 is opposite 6 and 3 is opposite to 5. Therefore opposite to 4 is 1."}, {"question": "Here two positions of dice are shown. If there are two dots in the bottom, then how many dots will be on the top?", "opta": "2", "optb": "3", "optc": "5", "optd": "6", "ans": "C", "explanation": "Here the common faces with 4 dots are in same positions.\nHence 2 will be opposite to 5."}, {"question": "Two positions of dice are shown below. How many points will be on the top when 2 points are at the bottom?", "opta": "6", "optb": "5", "optc": "4", "optd": "1", "ans": "D", "explanation": "In these 2 positions of a dice, one common face having points 3 is in the same position. Hence according to rule (3), there will be 4 points on the required face."}, {"question": "Here 4 positions of a cube are shown. Which sign will be opposite to '+' ?", "opta": "%", "optb": "-", "optc": "x", "optd": "$", "ans": "C", "explanation": "From position I and III common face with % is in the same position. Hence according to rule (3) opposite is X."}, {"question": "Two positions of a cubical block are shown. When 5 is at the top which number will be at bottom?", "opta": "1", "optb": "2", "optc": "3", "optd": "4", "ans": "C", "explanation": "In these 2 positions one common face with number 3, is in same position. Hence according to rule (3), 1 is opposite to 6 and 4 is opposite to 2. Therefore 5 is opposite to 3."}, {"question": "From the four positions of a dice given below, find the color which is opposite to yellow ?", "opta": "Violet", "optb": "Red", "optc": "Rose", "optd": "Blue", "ans": "A", "explanation": "The colours adjacent to yellow are orange, blue, red and rose. Hence violet will be opposite to yellow."}, {"question": "When the digit 5 is on the bottom then which number will be on its upper surface?", "opta": "1", "optb": "3", "optc": "4", "optd": "6", "ans": "A", "explanation": "According to the rule no. (3), common faces with number 2 are in same positions. Hence when the digit 5 is on the bottom then 1 will on the upper surface."}, {"question": "How many points will be on the face opposite to the face which contains 3 points?", "opta": "2", "optb": "4", "optc": "5", "optd": "6", "ans": "C", "explanation": "The adjacent faces to the face which 3 points have 2, 1, 4 and 6 points. Hence on the face which is opposite to the face which contains 3 points, there will be 5 points."}, {"question": "Observe the dots on the dice (one to six dots) in the following figures. How many dots are contained on the face opposite to the containing four dots?", "opta": "2", "optb": "3", "optc": "5", "optd": "6", "ans": "A", "explanation": "Here one of the two common faces (5) is in the same position, then according to the rule no (2) the remaining face with the 4 dots will be opposite to face with dots 2."}, {"question": "Two positions of a dice are shown below. When 3 points are at the bottom, how many points will be at the top?", "opta": "2", "optb": "5", "optc": "4", "optd": "6", "ans": "C", "explanation": "According to the rule (2) when 3 points are at the bottom then 4 points will be at the top."}, {"question": "From the positions of a cube are shown below, Which letter will be on the face opposite to face with 'A'?", "opta": "D", "optb": "B", "optc": "C", "optd": "F", "ans": "A", "explanation": "The letters of the adjacent faces to the face with letter A, are B, F, C and E. Hence D is the letter of the face opposite to the face with letters (A)."}]]}