{"test_questions": [[{"question": "The total of the ages of Amar, Akbar and Anthony is 80 years. What was the total of their ages three years ago ?", "opta": "71 years", "optb": "72 years", "optc": "74 years", "optd": "77 years", "ans": "A", "explanation": "Required sum = (80 - 3 x 3) years = (80 - 9) years = 71 years."}, {"question": "Two bus tickets from city A to B and three tickets from city A to C cost Rs. 77 but three tickets from city A to B and two tickets from city A to C cost Rs. 73. What are the fares for cities B and C from A ?", "opta": "Rs. 4, Rs. 23", "optb": "Rs. 13, Rs. 17", "optc": "Rs. 15, Rs. 14", "optd": "Rs. 17, Rs. 13", "ans": "B", "explanation": "Let Rs. x be the fare of city B from city A and Rs. y be the fare of city C from city A.Then, 2x + 3y = 77           ...(i)       and3x + 2y = 73           ...(ii)Multiplying (i) by 3 and (ii) by 2 and subtracting, we get: 5y = 85   or   y = 17.Putting y = 17 in (i), we get: x = 13."}, {"question": "An institute organised a fete and 1/5 of the girls and 1/8 of the boys participated in the same. What fraction of the total number of students took part in the fete ?", "opta": "2/13", "optb": "13/40", "optc": "Data inadequate", "optd": "None of these", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "A number of friends decided to go on a picnic and planned to spend Rs. 96 on eatables. Four of them, however, did not turn up. As a consequence, the remaining ones had to contribute Rs. 4 each extra. The number of those who attended the picnic was", "opta": "8", "optb": "12", "optc": "16", "optd": "24", "ans": "A", "explanation": ""}, {"question": "A, B, C, D and E play a game of cards. A says to B, \"If you give me three cards, you will have as many as E has and if I give you three cards, you will have as many as D has.\" A and B together have 10 cards more than what D and E together have. If B has two cards more than what C has and the total number of cards be 133, how many cards does B have ?", "opta": "22", "optb": "23", "optc": "25", "optd": "35", "ans": "C", "explanation": "Clearly, we have :B-3 = E                                    ...(i)B + 3 = D                                      ...(ii)A+B = D + E+10                    ...(iii)B = C + 2                                      ...(iv)A+B + C + D + E= 133            ...(v)From (i) and (ii), we have : 2 B = D + E  ...(vi)From (iii) and (vi), we have : A = B + 10  ...(vii)Using (iv), (vi) and (vii) in (v), we get:(B + 10) + B + (B - 2) + 2B = 133    5B = 125    B = 25."}, {"question": "A pineapple costs Rs. 7 each. A watermelon costs Rs. 5 each. X spends Rs. 38 on these fruits. The number of pineapples purchased is", "opta": "2", "optb": "3", "optc": "4", "optd": "Data inadequate", "ans": "C", "explanation": ""}, {"question": "A woman says, \"If you reverse my own age, the figures represent my husband's age. He is, of course, senior to me and the difference between our ages is one-eleventh of their sum.\" The woman's age is", "opta": "23 years", "optb": "34 years", "optc": "45 years", "optd": "None of these", "ans": "C", "explanation": "Let x and y be the ten's and unit's digits respectively of the numeral denoting the woman's age.Then, woman's age = (10X + y) years; husband's age = (10y + x) years.Therefore  (10y + x)- (10X + y) = (1/11) (10y + x + 10x + y)  (9y-9x) = (1/11)(11y + 11x) = (x + y)  10x = 8y  x = (4/5)yClearly, y should be a single-digit multiple of 5, which is 5.So, x = 4, y = 5.Hence, woman's age = 10x + y = 45 years."}, {"question": "A girl counted in the following way on the fingers of her left hand : She started by calling the thumb 1, the index finger 2, middle finger 3, ring finger 4, little finger 5 and then reversed direction calling the ring finger 6, middle finger 7 and so on. She counted upto 1994. She ended counting on which finger ?", "opta": "Thumb", "optb": "Index finger", "optc": "Middle finger", "optd": "Ring finger", "ans": "B", "explanation": "Clearly, while counting, the numbers associated to the thumb will be : 1, 9,17, 25,.....i.e. numbers of the form (8n + 1).Since 1994 = 249 x 8 + 2, so 1993 shall correspond to the thumb and 1994 to the index finger."}, {"question": "A man has Rs. 480 in the denominations of one-rupee notes, five-rupee notes and ten-rupee notes. The number of notes of each denomination is equal. What is the total number of notes that he has ?", "opta": "45", "optb": "60", "optc": "75", "optd": "90", "ans": "D", "explanation": "Let number of notes of each denomination be x.Then, x + 5x + 10x = 480   16x = 480   x = 30.Hence, total number of notes = 3x = 90."}, {"question": "What is the product of all the numbers in the dial of a telephone ?", "opta": "1,58,480", "optb": "1,59,450", "optc": "1,59,480", "optd": "None of these", "ans": "D", "explanation": "Since one of the numbers on the dial of a telephone is zero, so the product of all the numbers on it is 0."}, {"question": "A is 3 years older to B and 3 years younger to C, while B and D are twins. How many years older is C to D?", "opta": "2", "optb": "3", "optc": "6", "optd": "12", "ans": "C", "explanation": "Since B and D are twins, so B = D.Now, A = B + 3 and A = C - 3.Thus, B + 3 = C - 3   D + 3 = C-3   C - D = 6."}, {"question": "The 30 members of a club decided to play a badminton singles tournament. Every time a member loses a game he is out of the tournament. There are no ties. What is the minimum number of matches that must be played to determine the winner ?", "opta": "15", "optb": "29", "optc": "61", "optd": "None of these", "ans": "B", "explanation": "Clearly, every member except one (i.e. the winner) must lose one game to decide the winner. Thus, minimum number of matches to be played = 30 - 1 = 29."}, {"question": "In a garden, there are 10 rows and 12 columns of mango trees. The distance between the two trees is 2 metres and a distance of one metre is left from all sides of the boundary of the garden. The length of the garden is", "opta": "20 m", "optb": "22 m", "optc": "24 m", "optd": "26 m", "ans": "C", "explanation": "Each row contains 12 plants.There are 11 gapes between the two corner trees (11 x 2) metres and 1 metre on each side is left.Therefore Length = (22 + 2) m = 24 m."}, {"question": "12 year old Manick is three times as old as his brother Rahul. How old will Manick be when he is twice as old as Rahul ?", "opta": "14 years", "optb": "16 years", "optc": "18 years", "optd": "20 years", "ans": "B", "explanation": "Manick's present age = 12 years, Rahul's present age = 4 years.Let Manick be twice as old as Rahul after x years from now.Then, 12 + x = 2 (4 + x)   12 + x = 8 + 2x  x = 4.Hence, Manick's required age = 12 + x = 16 years."}, {"question": "A tailor had a number of shirt pieces to cut from a roll of fabric. He cut each roll of equal length into 10 pieces. He cut at the rate of 45 cuts a minute. How many rolls would be cut in 24 minutes ?", "opta": "32 rolls", "optb": "54 rolls", "optc": "108 rolls", "optd": "120 rolls", "ans": "D", "explanation": "Number of cuts made to cut a roll into 10 pieces = 9.Therefore Required number of rolls = (45 x 24)/9 = 120."}, {"question": "In a class of 60 students, the number of boys and girls participating in the annual sports is in the ratio 3 : 2 respectively. The number of girls not participating in the sports is 5 more than the number of boys not participating in the sports. If the number of boys participating in the sports is 15, then how many girls are there in the class ?", "opta": "20", "optb": "25", "optc": "30", "optd": "Data inadequate", "opte": "None of these", "ans": "C", "explanation": "Let the number of boys and girls participating in sports be 3x and 2x respectively.Then, 3x = 15 or x = 5.So, number of girls participating in sports = 2x = 10.Number of students not participating in sports = 60 - (15 + 10) = 35.Let number of boys not participating in sports be y.Then, number of girls not participating in sports = (35 -y).Therefore (35 - y) = y + 5    2y  30   y = 15.So, number of girls not participating in sports = (35 - 15) = 20.Hence, total number of girls in the class = (10 + 20) = 30."}, {"question": "There are deer and peacocks in a zoo. By counting heads they are 80. The number of their legs is 200. How many peacocks are there ?", "opta": "20", "optb": "30", "optc": "50", "optd": "60", "ans": "D", "explanation": "Let x and y be the number of deer and peacocks in the zoo respectively. Then,x + y = 80 ...(i) and4x + 2y = 200   or   2x + y = 100 ...(ii)Solving (i) and (ii), we get) x = 20, y = 60."}, {"question": "A man wears socks of two colours - Black and brown. He has altogether 20 black socks and 20 brown socks in a drawer. Supposing he has to take out the socks in the dark, how many must he take out to be sure that he has a matching pair ?", "opta": "3", "optb": "20", "optc": "39", "optd": "None of these", "ans": "A", "explanation": "Since there are socks of only two colours, so two out of any three socks must always be of the same colour."}, {"question": "A motorist knows four different routes from Bristol to Birmingham. From Birmingham to Sheffield he knows three different routes and from Sheffield to Carlisle he knows two different routes. How many routes does he know from Bristol to Carlisle ?", "opta": "4", "optb": "8", "optc": "12", "optd": "24", "ans": "D", "explanation": "Total number of routes from Bristol to Carlisle = (4 x 3 x 2) = 24."}, {"question": "Mac has £ 3 more than Ken, but then Ken wins on the horses and trebles his money, so that he now has £ 2 more than the original amount of money that the two boys had between them. How much money did Mac and Ken have between them before Ken's win ?", "opta": "£ 9", "optb": "£ 11", "optc": "£ 13", "optd": "£ 15", "ans": "C", "explanation": "Let money with Ken = x. Then, money with Mac = x + £ 3.Now, 3x = (x + x + £ 3) + £ 2   x = £ 5.Therefore Total money with Mac and Ken = 2x + £ 3 = £ 13."}, {"question": "In a class, there are 18 boys who are over 160 cm tall. If these constitute three-fourths of the boys and the total number of boys is two-thirds of the total number of students in the class, what is the number of girls in the class ?", "opta": "6", "optb": "12", "optc": "18", "optd": "24", "ans": "B", "explanation": "Let the number of boys be x. Then, (3/4)x = 18   or   x = 18 x(4/3) = 24.If total number of students is y, then (2/3) y = 24   or   y = 24 x (3/2) = 36.Therefore Number of girls in the class = (36 - 24) = 12."}, {"question": "A father is now three times as old as his son. Five years back, he was four times as old as his son. The age of the son (in years) is", "opta": "12", "optb": "15", "optc": "18", "optd": "20", "ans": "B", "explanation": "Let son's age be x years. Then, father's age = (3x) years.Five years ago, father's age = (3x - 5) years and son's age = (x - 5) years.So, 3x - 5 = 4 (x - 5)  3x - 5 = 4x - 20   x = 15."}, {"question": "A waiter's salary consists of his salary and tips. During one week his tips were 5/4 of his salary. What fraction of his income came from tips ?", "opta": "4/9", "optb": "5/4", "optc": "5/8", "optd": "5/9", "ans": "D", "explanation": ""}, {"question": "If you write down all the numbers from 1 to 100, then how many times do you write 3 ?", "opta": "11", "optb": "18", "optc": "20", "optd": "21", "ans": "C", "explanation": "Clearly, from 1 to 100, there are ten numbers with 3 as the unit's digit- 3, 13, 23, 33, 43, 53, 63, 73, 83, 93; and ten numbers with 3 as the ten's digit - 30, 31, 32, 33, 34, 35, 36, 37, 38, 39.So, required number = 10 + 10 = 20."}, {"question": "If 100 cats kill 100 mice in 100 days, then 4 cats would kill 4 mice in how many days ?", "opta": "1 day", "optb": "4 days", "optc": "40 days", "optd": "100 days", "ans": "D", "explanation": ""}, {"question": "Five bells begin to toll together and toll respectively at intervals of 6, 5, 7, 10 and 12 seconds. How many times will they toll together in one hour excluding the one at the start ?", "opta": "7 times", "optb": "8 times", "optc": "9 times", "optd": "11 times", "ans": "B", "explanation": "L.C.M. of 6, 5, 7, 10 and 12 is 420.So, the bells will toll together after every 420 seconds i.e. 7 minutes.Now, 7 x 8 = 56 and 7 x 9 = 63.Thus, in 1-hour (or 60 minutes), the bells will toll together 8 times, excluding the one at the start."}, {"question": "A bus starts from city X. The number of women in the bus is half of the number of men. In city Y, 10 men leave the bus and five women enter. Now, number of men and women is equal. In the beginning, how many passengers entered the bus ?", "opta": "15", "optb": "30", "optc": "36", "optd": "45", "ans": "D", "explanation": "Originally, let number of women = x. Then, number of men = 2x.So, in city Y, we have : (2x - 10) = (x + 5)   or   x - 15.Therefore Total number of passengers in the beginning = (x + 2x) = 3x = 45."}, {"question": "A, B, C, D and E play a game of cards. A says to B, \"If you give me 3 cards, you will have as many as I have at this moment while if D takes 5 cards from you, he will have as many as E has.\" A and C together have twice as many cards as E has. B and D together also have the same number of cards as A and C taken together. If together they have 150 cards, how many cards has C got ?", "opta": "28", "optb": "29", "optc": "31", "optd": "35", "ans": "A", "explanation": "Clearly, we have :A = B - 3 ...(i)D + 5 = E ...(ii)A+C = 2E ...(iii)B + D = A+C = 2E ...(iv)A+B + C + D + E=150 ...(v)From (iii), (iv) and (v), we get: 5E = 150   or   E = 30.Putting E = 30 in (ii), we get: D = 25.Putting E = 30 and D = 25 in (iv), we get: B = 35.Putting B = 35 in (i), we get: A = 32.Putting A = 32 and E = 30 in (iii), we get: C = 28."}, {"question": "A farmer built a fence around his square plot. He used 27 fence poles on each side of the square. How many poles did he need altogether ?", "opta": "100", "optb": "104", "optc": "108", "optd": "None of these", "ans": "B", "explanation": "Since each pole at the corner of the plot is common to its two sides, so we have :Total number of poles needed = 27 x 4 - 4 = 108 - 4 = 104."}, {"question": "In a city, 40% of the adults are illiterate while 85% of the children are literate. If the ratio of the adults to that of the children is 2 : 3, then what percent of the population is literate ?", "opta": "20%", "optb": "25%", "optc": "50%", "optd": "75%", "ans": "D", "explanation": ""}, {"question": "A is three times as old as B. C was twice-as old as A four years ago. In four years' time, A will be 31. What are the present ages of B and C ?", "opta": "9, 46", "optb": "9, 50", "optc": "10, 46", "optd": "10, 50", "ans": "B", "explanation": "We have : A = 3B ...(i) andC - 4 = 2 (A - 4) ...(ii)Also, A + 4 = 31 or  A= 31-4 = 27.Putting A = 27 in (i), we get: B = 9.Putting A = 27 in (ii), we get C = 50."}, {"question": "Today is Varun's birthday. One year, from today he will be twice as old as he was 12 years ago. How old is Varun today ?", "opta": "20 years", "optb": "22 years", "optc": "25 years", "optd": "27 years", "ans": "C", "explanation": "Let Varan's age today = x years.Then, Varan's age after 1 year = (x + 1) years.Therefore x + 1 = 2 (x - 12)  x + 1 = 2x - 24  x = 25."}, {"question": "A bird shooter was askgd how many birds he had in the bag. He replied that there were all sparrows but six, all pigeons but six, and all ducks but six. How many birds he had in the bag in all?", "opta": "9", "optb": "18", "optc": "27", "optd": "36", "ans": "A", "explanation": "There were all sparrows but six' means that six birds were not sparrows but only pigeons and ducks.Similarly, number of sparrows + number of ducks = 6 and number of sparrows + number of pigeons = 6.This is possible when there are 3 sparrows, 3 pigeons and 3 ducks i.e. 9 birds in all."}, {"question": "Mr. Johnson was to earn £ 300 and a free holiday for seven weeks' work. He worked for only 4 weeks and earned £ 30 and a free holiday. What was the value of the holiday?", "opta": "£ 300", "optb": "£ 330", "optc": "£ 360", "optd": "£ 420", "ans": "B", "explanation": ""}, {"question": "What is the smallest number of ducks that could swim in this formation - two ducks in front of a duck, two ducks behind a duck and a duck between two ducks ?", "opta": "3", "optb": "5", "optc": "7", "optd": "9", "ans": "A", "explanation": "Clearly, the smallest such number is 3.Three ducks can be arranged as shown above to satisfy all the three given conditions."}, {"question": "Three friends had dinner at a restaurant. When the bill was received, Amita paid 2/3 as much as Veena paid and Veena paid 1/2 as much as Tanya paid. What faction of the bill did Veena pay ?", "opta": "1/3", "optb": "3/11", "optc": "12/13", "optd": "5/8", "ans": "B", "explanation": ""}, {"question": "In a class, 20% of the members own only two cars each, 40% of the remaining own three cars each and the remaining members own only one car each. Which of the following statements is definitely true from the given statements ?", "opta": "Only 20% of the total members own three cars each.", "optb": "48% of the total members own only one car each.", "optc": "60% of the total members own at least two cars each.", "optd": "80% of the total members own at least one car.", "opte": "None of these", "ans": "B", "explanation": "Let total number of members be 100,Then, number of members owning only 2 cars = 20.Number of members owning 3 cars = 40% of 80 = 32.Number of members owning only 1 car = 100 - (20 + 32) = 48.Thus, 48% of the total members own one car each."}, {"question": "When Rahul was born, his father was 32 years older than his brother and his mother was 25 years older than his sister. If Rahul's brother is 6 years older than him and his mother is 3 years younger than his father, how old was Rahul's sister when he was born ?", "opta": "7 years", "optb": "10 years", "optc": "14 years", "optd": "19 years", "ans": "B", "explanation": "When Rahul was born, his brother's age = 6 years; his father's age = (6 + 32) years = 38 years, his mother's age = (38 - 3) years = 35 years; his sister's age = (35 - 25) years = 10 years."}, {"question": "A certain number of horses and an equal number of men are going somewhere. Half of the owners are on their horses' back while the remaining ones are walking along leading their horses. If the number of legs walking on the ground is 70, how many horses are there ?", "opta": "10", "optb": "12", "optc": "14", "optd": "16", "ans": "C", "explanation": "Let number of horses = number of men = x.Then, number of legs = 4x + 2 x (x/2) = 5x.So, 5X = 70   or   x = 14."}, {"question": "Ravi's brother is 3 years senior to him. His father was 28 years of age when his sister was born while his mother was 26 years of age when he was born. If his sister was 4 years of age when his brother was born, what were the ages of Ravi's father and mother respectively when his brother was born ?", "opta": "32 years, 23 years", "optb": "32 years, 29 years", "optc": "35 years, 29 years", "optd": "35 years, 33 years", "ans": "A", "explanation": "When Ravi's brother was born, let Ravi's father's age = x years and mother's age = y years.Then, sister's age = (x - 28) years. So, x - 28 = 4   or   x = 32.Ravi's age = (y - 26) years. Age of Ravi's brother = (y - 26 + 3) years = (y - 23) years.Now, when Ravi's brother was born, his age = 0 i.e. y - 23 = 0   or   y = 23."}, {"question": "The number of boys in a class is three times the number of girls. Which one of the following numbers cannot represent the total number of children in the class ?", "opta": "48", "optb": "44", "optc": "42", "optd": "40", "ans": "C", "explanation": "Let number of girls = x and number of boys = 3x.Then, 3x + x = 4x = total number of students.Thus, to find exact value of x, the total number of students must be divisible by 4."}, {"question": "A shepherd had 17 sheep. All but nine died. How many was he left with ?", "opta": "Nil", "optb": "8", "optc": "9", "optd": "17", "ans": "C", "explanation": "'All but nine died' means 'All except nine died' i.e. 9 sheep remained alive."}, {"question": "In a family, the father took 1/4 of the cake and he had 3 times as much as each of the other members had. The total number of family members is", "opta": "3", "optb": "7", "optc": "10", "optd": "12", "ans": "C", "explanation": ""}, {"question": "In three coloured boxes - Red, Green and Blue, 108 balls are placed. There are twice as many balls in the green and red boxes combined as there are in the blue box and twice as many in the blue box as there are in the red box. How many balls are there in the green box ?", "opta": "18", "optb": "36", "optc": "45", "optd": "None of these", "ans": "D", "explanation": "Let R, G and B represent the number of balls in red, green and blue boxes respectively.Then, .R + G + B = 108       ...(i),G + R = 2B       ...(ii)B = 2R       ...(iii)From (ii) and (iii), we have G + R = 2x 2R = 4R   or   G = 3R.Putting G = 3R and B = 2R in (i), we get:R + 3R + 2R = 108      6R = 108      R = 18.Therefore Number of balls in green box = G = 3R = (3 x 18) = 54."}, {"question": "In a cricket match, five batsmen A, B, C, D and E scored an average of 36 runs. D Scored 5 more than E; E scored 8 fewer than A; B scored as many as D and E combined; and B and C scored 107 between them. How many runs did E score ?", "opta": "62", "optb": "45", "optc": "28", "optd": "20", "ans": "D", "explanation": "Total runs scored = (36 x 5) = 180.Let the runs scored by E be x.Then, runs scored by D = x + 5; runs scored by A = x + 8;runs scored by B = x + x + 5 = 2x + 5;runs scored by C = (107 - B) = 107 - (2x + 5) = 102 - 2x.So, total runs = (x + 8) + (2x + 5) + (102 - 2x) + (x + 5) + x = 3x + 120.Therefore 3x + 120 =180  3X = 60  x = 20."}, {"question": "The total number of digits used in numbering the pages of a book having 366 pages is", "opta": "732", "optb": "990", "optc": "1098", "optd": "1305", "ans": "B", "explanation": "Total number of digits= (No. of digits in 1- digit page nos. + No. of digits in 2-digit page nos. + No. of digits in 3- digit page nos.)= (1 x 9 + 2 x 90 + 3 x 267) = (9 + 180 + 801) = 990."}, {"question": "In a family, each daughter has the same number of brothers as she has sisters and each son has twice as many sisters as he has brothers. How many sons are there in the family ?", "opta": "2", "optb": "3", "optc": "4", "optd": "5", "ans": "B", "explanation": "Let d and s represent the number of daughters and sons respectively.Then, we have :d - 1 = s       and       2 (s - 1) = d.Solving these two equations, we get: d = 4, s = 3."}, {"question": "At a dinner party every two guests used a bowl of rice between them, every three guests used a bowl of dal between them and every four used a bowl of meat between them. There were altogether 65 dishes. How many guests were present at the party ?", "opta": "60", "optb": "65", "optc": "90", "optd": "None of these", "ans": "A", "explanation": ""}, {"question": "Ayush was born two years after his father's marriage. His mother is five years younger than his father but 20 years older than Ayush who is 10 years old. At what age did the father get married ?", "opta": "23 years", "optb": "25 years", "optc": "33 years", "optd": "35 years", "ans": "A", "explanation": "Ayush's present age = 10 years.His mother's present age = (10 + 20) years = 30 years.Ayush's father's present age = (30 + 5) years = 35 years.Ayush's father's age at the time of Ayush's birth = (35 - 10) years = 25 years.Therefore Ayush's father's age at the time of marriage = (25 - 2) years = 23 years."}]]}