{"test_questions": [[{"question": "Senators from urban areas are very concerned about assuring that there will be funding for a new international airport. Senators from rural areas refuse to fund anything until money for agricultural subsidies is appropriated. If the legislature funds these two programs, on which of the following could they spend the rest of the money?", "opta": "the school music program and national radio", "optb": "hurricane preparedness", "optc": "harbor improvements and the school music program", "optd": "small business loan program", "opte": "national radio and senate office building remodeling", "ans": "A", "explanation": "The total cost of the school music program and national radio is $1 million, the amount left after the international airport and agricultural subsidies are funded.\r\nInternational airport + Agricultural subsidy program\r\n$4 million + $2 million = $6 million\r\nschool music program and national radio is $1 million.\r\nHence, Total $7 million."}, {"question": "If the legislature decides to fund the agricultural subsidy program, national radio, and the small business loan program, what two other programs could they fund?", "opta": "harbor improvements and international airport", "optb": "harbor improvements and school music program", "optc": "hurricane preparedness and school music program", "optd": "hurricane preparedness and international airport", "opte": "harbor improvements and hurricane preparedness", "ans": "B", "explanation": "The only two programs that total 1.5 million dollars are the harbor improvements and school music program."}, {"question": "If the legislature decides to fund the agricultural subsidy program, national radio, and the small business loan program, the only other single program that can be funded is", "opta": "hurricane preparedness.", "optb": "harbor improvements.", "optc": "school music program.", "optd": "senate office building remodeling.", "opte": "international airport.", "ans": "D", "explanation": "The total of the three programs (2 million + 0.5 million + 3 million) is 5.5 million. That leaves 1.5 million (7 million - 5.5 million), and the only single program needing that amount is the senate office building remodeling."}]]}