{"test_questions": [[{"question": "One New York publisher has estimated that 50,000 to 60,000 people in the United States want an anthology that includes the complete works of William Shakespeare. And what accounts for this renewed interest in Shakespeare? As  scholars point out, his psychological insights into both male and female characters are amazing even today. \nThis paragraph best supports the statement that", "opta": "Shakespeare's characters are more interesting than fictional characters today.", "optb": "people even today are interested in Shakespeare's work because of the characters.", "optc": "academic scholars are putting together an anthology of Shakespeare's work.", "optd": "New Yorkers have a renewed interested in the work of Shakespeare.", "opte": "Shakespeare was a psychiatrist as well as a playwright.", "ans": "B", "explanation": "The last sentence in the paragraph clearly gives support for the idea that the interest in Shakespeare is due to the development of his characters. Choice a is incorrect because the writer never makes this type of comparison. Choice c is wrong because even though scholars are mentioned in the paragraph, there is no indication that the scholars are compiling the anthology. Choice d is wrong because there is no support to show that most New Yorkers are interested in this work. There is no support for choice e either."}, {"question": "One of the warmest winters on record has put consumers in the mood to spend money. Spending is likely to be the strongest in thirteen years. During the month of February, sales of existing single-family homes hit an annual record rate of 4.75 million.\nThis paragraph best supports the statement that", "opta": "consumer spending will be higher thirteen years from now than it is today.", "optb": "more people buy houses in the month of February than in any other month.", "optc": "during the winter months, the prices of single-family homes are the lowest.", "optd": "there were about 4 million homes for sale during the month of February.", "opte": "warm winter weather is likely to affect the rate of home sales.", "ans": "E", "explanation": "This is clearly the best answer because the paragraph  directly states that warm weather affects consumers inclination  to spend. It furthers states that the sales of single-family homes was at an all-time high. There is no support for choice a or c. Choice b is wrong because even though there were high sales for a particular February, this does not mean that sales are not higher in other months. Choice d presents a misleading figure of 4 million. The paragraph states that the record of 4.75 million was at an annual, not a monthly, rate."}, {"question": "Generation Xers are those people born roughly between 1965 and 1981. As employees, Generation Xers tend to be more challenged when they can carry out tasks independently. This makes Generation Xers the most entrepreneurial generation in history.\nThis paragraph best supports the statement that Generation Xers", "opta": "work harder than people from other generations.", "optb": "have a tendency to be self-directed workers", "optc": "have an interest in making history", "optd": "tend to work in jobs that require risk-taking behavior.", "opte": "like to challenge their bosses work attitudes.", "ans": "B", "explanation": "The support for choice b is given in the second sentence of the paragraph. Generation Xers like to work independently, which means they are self-directed. No support is given for either choice a or choice c. Choice d is not related to the paragraph. Although the paragraph mentions that Generation Xers like to be challenged, it does not say they like to challenge their bosses attitudes; therefore, choice  e can be ruled out."}, {"question": "If you're a fitness walker, there is no need for a commute to a health club. Your neighborhood can be your health club. You don't need a lot of fancy equipment to get a good workout either. All you need is a well-designed pair of athletic shoes.\nThis paragraph best supports the statement that", "opta": "fitness walking is a better form of exercise than weight lifting.", "optb": "a membership in a health club is a poor investment.", "optc": "walking outdoors provides a better workout than walking indoors.", "optd": "fitness walking is a convenient and valuable form of exercise.", "opte": "poorly designed athletic shoes can cause major foot injuries.", "ans": "D", "explanation": "By stating that fitness walking does not require a commute to a health club, the author stresses the convenience of this form of exercise. The paragraph also states that fitness walking will result in a good workout. Choice a is incorrect because no comparison to weight lifting is made. Choice b may seem like a logical answer, but the paragraph only refers to people who are fitness walkers, so for others, a health club might be a good investment. Choice c is not in the passage. Although choice e seems logical, the paragraph does not indicate that the wrong shoes will produce major injuries."}, {"question": "In the past, consumers would rarely walk into an ice cream store and order low-fat ice cream. But that isn't the case today. An increasing health consciousness combined with a much bigger selection of tasty low-fat foods in all categories has made low-fat ice cream a very profitable item for ice cream store owners.\nThis paragraph best supports the statement that", "opta": "low-fat ice cream produces more revenue than other low-fat foods.", "optb": "ice cream store owners would be better off carrying only low-fat ice cream.", "optc": "ice cream store owners no longer think that low-fat ice cream is an unpopular item.", "optd": "low-fat ice cream is more popular than other kinds of ice cream.", "opte": "consumers are fickle and it is impossible to please them", "ans": "C", "explanation": "This choice is supported as the best answer because the paragraph indicates that low-fat ice cream was once an unpopular item, but now, because consumers are more health conscious and because there is a wider array of tasty low-fat foods, low-fat ice cream is a profitable item for ice cream store owners. There is no indication that choices a, b, d,or e are true based on the information given."}, {"question": "Today's high school students spend too much time thinking about trivial and distracting matters such as fashion. Additionally, they often dress inappropriately on school grounds. Rather than spending time writing another detailed dress policy, we should make school uniforms mandatory. If students were required to wear uniforms, it would increase a sense of community and harmony in our schools and it would instill a sense of discipline in our students. Another positive effect would be that teachers and administrators would no longer have to act as clothing police, freeing them up to focus on more important issues.\nThis paragraph best supports the statement that", "opta": "inappropriate clothing leads to failing grades.", "optb": "students who wear school uniforms get into better colleges.", "optc": "teachers and administrators spend at least 25% of their time enforcing the dress code.", "optd": "students are not interested in being part of a community", "opte": "school uniforms should be compulsory for high school students.", "ans": "E", "explanation": "The support for choice e is in the third sentence \"we should make school uniforms mandatory\". There is no evidence provided to support choices a, b, and d. And although we know that teachers and administrators are spending some of their time enforcing dress code, the paragraph does not quantify how much of their time is spent that way, so there is no support for choice c."}, {"question": "The criminal justice system needs to change. The system could be more just if it allowed victims the opportunity to confront the person who has harmed them. Also, mediation between victims and their offenders would give the offenders a chance to apologize for the harm they have done.\nThis paragraph best supports the statement that victims of a crime should", "opta": "learn to forgive their offenders.", "optb": "have the right to confront their offenders.", "optc": "learn the art of mediation.", "optd": "insist that their offenders be punished.", "opte": "have the right to impose a sentence on their offenders.", "ans": "B", "explanation": "This answer is clearly stated in the first sentence of  the paragraph. There is no support in the passage for choices a, d,or e. As  for choice c, although mediation is mentioned, the statement does not indicate that victims should be the mediators."}, {"question": "A few states in this country are considering legislation that would prohibit schools from using calculators before the sixth grade. Other states take a different position. Some states are insisting on the purchase of graphing calculators for every student in middle school.\nThis paragraph best supports the statement that in this country", "opta": "there are at least two opinions about the use of calculators in schools.", "optb": "calculators are frequently a detriment to learning math.", "optc": "state legislators are more involved in education than ever before.", "optd": "the price of graphing calculators is less when schools buy in bulk.", "opte": "the argument against calculators in schools is unfounded.", "ans": "A", "explanation": "The paragraph clearly states that there are two differing opinions with regard to the use of calculators in the classroom. Although some people may believe that choice  b is true, the paragraph does not  indicate this. Choice c has no relation to the paragraph. Choice d makes logical sense, but the paragraph says nothing about cost. Choice e is an opinion that is not given in the paragraph."}, {"question": "Today's workforce has a new set of social values. Ten years ago, a manager who was offered a promotion in a distant city would not have questioned the move. Today, a manager in that same situation might choose family happiness instead of career advancement.\nThis paragraph best supports the statement that", "opta": "most managers are not loyal to the corporations for which they work.", "optb": "businesses today do not understand their employees needs.", "optc": "employees social values have changed over the past ten years.", "optd": "career advancement is not important to today's business managers.", "opte": "companies should require their employees to accept promotions.", "ans": "C", "explanation": "A change in employee social values over the past ten years is implied in the whole paragraph, but particularly in the first sentence. Choice a is incorrect because the loyalty of the managers to their corporations is never discussed. There is no support for choice b. In choice d, perhaps career advancement is less important than it once was, but the paragraph does not indicate that advancement is unimportant to managers. Choice e is an opinion that is not supported."}, {"question": "It is well known that the world urgently needs adequate distribution of food, so that everyone gets enough. Adequate distribution of medicine is just as urgent. Medical expertise and medical supplies need to be redistributed throughout the world so that people in emerging nations will have proper medical care.\nThis paragraph best supports the statement that", "opta": "the majority of the people in the world have never been seen by a doctor.", "optb": "food production in emerging nations has slowed during the past several years.", "optc": "most of the world's doctors are selfish about giving time and money to the poor.", "optd": "the medical-supply industry should step up production of its products.", "opte": "many people who live in emerging nations are not receiving proper medical care", "ans": "E", "explanation": "This answer is implied by the statement that redistribution is needed so that people in emerging nations can have proper medical care. Choices a, b, and c are not mentioned in the passage. Choice d is also incorrect—the passage indicates that the distribution of medicine, not  its production, is inadequate."}]]}