{"test_questions": [[{"question": "Vincent has a paper route. Each morning, he delivers 37 newspapers to customers in his neighborhood. It takes Vincent 50 minutes to deliver all the papers. If Vincent is sick or has other plans, his friend Thomas, who lives on the same street, will sometimes deliver the papers for him.", "opta": "Vincent and Thomas live in the same neighborhood.", "optb": "It takes Thomas more than 50 minutes to deliver the papers.", "optc": "It is dark outside when Vincent begins his deliveries.", "optd": "Thomas would like to have his own paper route.", "ans": "A", "explanation": "The fact that Vincent and Thomas live on the same street indicates that they live in the same neighborhood. There is no support for any of the other choices."}, {"question": "The Pacific yew is an evergreen tree that grows in the Pacific Northwest. The Pacific yew has a fleshy, poisonous fruit. Recently, taxol, a substance found in the bark of the Pacific yew, was discovered to be a promising new anticancer drug.", "opta": "Taxol is poisonous when taken by healthy people.", "optb": "Taxol has cured people from various diseases.", "optc": "People should not eat the fruit of the Pacific yew.", "optd": "The Pacific yew was considered worthless until taxol was discovered.", "ans": "C", "explanation": "Given the information presented, the only statement that could be considered true is that the fruit should not be eaten because it is poisonous. There is no support that taxol is poisonous or that taxol has cured anyone (choices a and b). There is no support for choice d."}, {"question": "Erin is twelve years old. For three years, she has been asking her parents for a dog. Her parents have told her that they believe a dog would not be happy in an apartment, but they have given her permission to have a bird. Erin has not yet decided what kind of bird she would like to have.", "opta": "Erin's parents like birds better than they like dogs.", "optb": "Erin does not like birds.", "optc": "Erin and her parents live in an apartment.", "optd": "Erin and her parents would like to move.", "ans": "C", "explanation": "Since Erin's parents think a dog would not be happy in an apartment, we can reasonably conclude that the family lives in an apartment. We do not know if Erin's parents dislike dogs (choice a) or if Erin  dislikes birds (choice b).There is no support for choice d."}, {"question": "Tim's commute never bothered him because there were always seats available on the train and he was able to spend his 40 minutes comfortably reading the newspaper or catching up on paperwork. Ever since the train schedule changed, the train has been extremely crowded, and by the time the doors open at his station, there isn't a seat to be found.", "opta": "Tim would be better off taking the bus to work.", "optb": "Tim's commute is less comfortable since the train schedule changed.", "optc": "Many commuters will complain about the new train schedule.", "optd": "Tim will likely look for a new job closer to home.", "ans": "B", "explanation": "The passage tells us that Tim's commute didn't bother  him because he was always able to sit down and comfortably read or do paperwork. Therefore, it is reasonable to assume that Tim's commute has become less comfortable since the schedule change, because it is very crowded and he can no longer find a seat. There is no information given that supports choices a, c, and d."}, {"question": "When they heard news of the hurricane, Maya and Julian decided to change their vacation plans. Instead of traveling to the island beach resort, they booked a room at a fancy new spa in the mountains. Their plans were a bit more expensive, but they'd heard wonderful things about the spa and they were relieved to find availability on such short notice.", "opta": "Maya and Julian take beach vacations every year.", "optb": "The spa is overpriced.", "optc": "It is usually necessary to book at least six months in advance at the spa.", "optd": "Maya and Julian decided to change their vacation plans because of the hurricane.", "ans": "D", "explanation": "The first sentence makes this statement true. There is no support for choice a. The passage tells us that the spa vacation is more expensive than the island beach resort vacation, but that doesn't necessarily mean that the spa is overpriced; therefore, choice b cannot be supported. And even though the paragraph says that the couple was relieved to find a room on short notice, there is no information to support choice c, which says that it is usually necessary to book at the spa at least six months in advance."}, {"question": "Ten new television shows appeared during the month of September. Five of the shows were sitcoms, three were hour-long dramas, and two were news-magazine shows. By January, only seven of these new shows were still on the air. Five of the shows that remained were sitcoms.", "opta": "Only one of the news-magazine shows remained on the air.", "optb": "Only one of the hour-long dramas remained on the air.", "optc": "At least one of the shows that was cancelled was an hour-long drama.", "optd": "Television viewers prefer sitcoms over hour-long dramas.", "ans": "C", "explanation": "If there were seven shows left and five were sitcoms, this means that only two of the shows could possibly be dramas. Choices a and b may be true, but there is no evidence to indicate this as fact. The fact that all of the sitcoms remained does not necessarily mean that viewers prefer sitcoms (choice d)."}, {"question": "On weekends, Mr. Sanchez spends many hours working in his vegetable and flower gardens. Mrs. Sanchez spends her free time reading and listening to classical music. Both Mr. Sanchez and Mrs. Sanchez like to cook.", "opta": "Mr. Sanchez enjoys planting and growing vegetables.", "optb": "Mr. Sanchez does not like classical music.", "optc": "Mrs. Sanchez cooks the vegetables that Mr. Sanchez grows.", "optd": "Mrs. Sanchez enjoys reading nineteenth century novels.", "ans": "A", "explanation": "Because Mr. Sanchez spends many hours during the weekend working in his vegetable garden, it is reasonable to suggest that he enjoys this work. There is no information to suggest that he does not like classical music. Although Mrs. Sanchez likes to cook, there is nothing that indicates she cooks vegetables (choice c). Mrs. Sanchez likes to read, but there is no information regarding the types of books she reads (choice d)."}, {"question": "Georgia is older than her cousin Marsha. Marsha's brother Bart is older than Georgia. When Marsha and Bart are visiting with Georgia, all three like to play a game of Monopoly. Marsha wins more often than Georgia does.", "opta": "When he plays Monopoly with Marsha and Georgia, Bart often loses.", "optb": "Of the three, Georgia is the oldest.", "optc": "Georgia hates to lose at Monopoly.", "optd": "Of the three, Marsha is the youngest.", "ans": "D", "explanation": "If Georgia is older than Marsha and Bart is older than Georgia, then Marsha has to be the youngest of the three. Choice b is clearly wrong because Bart is the oldest. There is no information in the paragraph to support either choice a or choice c."}, {"question": "Sara lives in a large city on the East Coast. Her younger cousin Marlee lives in the Mid-west in a small town with fewer than 1,000 residents. Marlee has visited Sara several times during the past five years. In the same period of time, Sara has visited Marlee only once.", "opta": "Marlee likes Sara better than Sara likes Marlee.", "optb": "Sara thinks small towns are boring.", "optc": "Sara is older than Marlee.", "optd": "Marlee wants to move to the East Coast.", "ans": "C", "explanation": "Since the paragraph states that Marlee is the younger cousin, Sara must be older than Marlee. There is no information to support the other choices."}]]}