{"test_questions": [[{"question": "In which decade was the American Institute of Electrical Engineers (AIEE) founded?", "opta": "1850s", "optb": "1880s", "optc": "1930s", "optd": "1950s", "ans": "B", "explanation": "The IEEE (Institute of Electrical and Electronics Engineers) was formed in 1963 by the merger of the Institute of Radio Engineers (IRE, founded 1912) and the American Institute of Electrical Engineers (AIEE, founded 1884)."}, {"question": "What is part of a database that holds only one type of information?", "opta": "Report", "optb": "Field", "optc": "Record", "optd": "File", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "'OS' computer abbreviation usually means ?", "opta": "Order of Significance", "optb": "Open Software", "optc": "Operating System", "optd": "Optical Sensor", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "In which decade with the first transatlantic radio broadcast occur?", "opta": "1850s", "optb": "1860s", "optc": "1870s", "optd": "1900s", "ans": "D", "explanation": "On December 12, 1901, a radio transmission received by Guglielmo Marconi resulted in the first transmission of a transatlantic wireless signal (Morse Code) from Poldhu, Cornwall, to St. John's, Newfoundland."}, {"question": "'.MOV' extension refers usually to what kind of file?", "opta": "Image file", "optb": "Animation/movie file", "optc": "Audio file", "optd": "MS Office document", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "In which decade was the SPICE simulator introduced?", "opta": "1950s", "optb": "1960s", "optc": "1970s", "optd": "1980s", "ans": "C", "explanation": "SPICE (Simulation Program with Integrated Circuit Emphasis) was introduced in May 1972 by the University of Berkeley, California."}, {"question": "Most modern TV's draw power even if turned off. The circuit the power is used in does what function?", "opta": "Sound", "optb": "Remote control", "optc": "Color balance", "optd": "High voltage", "ans": "B", "explanation": "Some authorities are recommending TV's, VCR's and Stereo's be connected to power strips with switches and turned off when not in use to save energy. Your remote will not work until power is switched back on."}, {"question": "Which is a type of Electrically-Erasable Programmable Read-Only Memory?", "opta": "Flash", "optb": "Flange", "optc": "Fury", "optd": "FRAM", "ans": "A", "explanation": "It's commonly used for MP3 players, computer BIOS code and \"thumb\" drives. Originally developed in Japan by Toshiba, it has become quite popular for products requiring non-volatile erasable memory. Flash devices have a limited number of erase cycles (typically 10,000 to 1,000,000 cycles) so they're not as good a choice for applications in which the data changes constantly. However, since it has no moving parts (unlike a hard disk) it is an excellent choice for storing the operating code for small personal electronics like PDAs, cell phones, digital cameras, and the data in items like MP3 players."}, {"question": "The purpose of choke in tube light is ?", "opta": "To decrease the current", "optb": "To increase the current", "optc": "To decrease the voltage momentarily", "optd": "To increase the voltage momentarily", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "'.MPG' extension refers usually to what kind of file?", "opta": "WordPerfect Document file", "optb": "MS Office document", "optc": "Animation/movie file", "optd": "Image file", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Who is largely responsible for breaking the German Enigma codes, created a test that provided a foundation for artificial intelligence?", "opta": "Alan Turing", "optb": "Jeff Bezos", "optc": "George Boole", "optd": "Charles Babbage", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Who developed Yahoo?", "opta": "Dennis Ritchie & Ken Thompson", "optb": "David Filo & Jerry Yang", "optc": "Vint Cerf & Robert Kahn", "optd": "Steve Case & Jeff Bezos", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Made from a variety of materials, such as carbon, which inhibits the flow of current...?", "opta": "Choke", "optb": "Inductor", "optc": "Resistor", "optd": "Capacitor", "ans": "C", "explanation": "So named because it resists (or inhibits) the flow of current."}, {"question": "The most common format for a home video recorder is VHS. VHS stands for...?", "opta": "Video Home System", "optb": "Very high speed", "optc": "Video horizontal standard", "optd": "Voltage house standard", "ans": "A", "explanation": "JVC (Japan Victor Corporation) and Matsushita (Panasonic) developed the VHS format to compete with Sony which developed the Beta format as the first home video cassette recorder. VHS originally stood for Vertical Helical Scan, but now means Video Home System."}, {"question": "What does VVVF stand for?", "opta": "Variant Voltage Vile Frequency", "optb": "Variable Velocity Variable Fun", "optc": "Very Very Vicious Frequency", "optd": "Variable Voltage Variable Frequency", "ans": "D", "explanation": "It is a method of controlling the speed of an AC induction motor, whereby speed, current and torque can all be accurately controlled."}, {"question": "What frequency range is the High Frequency band?", "opta": "100 kHz", "optb": "1 GHz", "optc": "30 to 300 MHz", "optd": "3 to 30 MHz", "ans": "D", "explanation": "The HF band is based on frequencies 3 to 30 Mhz. AM radio stations are in the HF band but normally are stated in kilohertz."}, {"question": "The first step to getting output from a laser is to excite an active medium. What is this process called?", "opta": "Pumping", "optb": "Exciting", "optc": "Priming", "optd": "Raising", "ans": "A", "explanation": "A collection of atoms or molecules that can be excited to a higher energy state is called an active medium. Before lasing can occur, the active media is \"pumped\". The process of raising the atoms in the active media from a lower energy state to a higher state is like pumping water up from a well."}, {"question": "What is the relationship between resistivity r and conductivity s?", "opta": "R = s2", "optb": "R = s", "optc": "R > s", "optd": "R = 1/s", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Which motor is NOT suitable for use as a DC machine?", "opta": "Permanent magnet motor", "optb": "Series motor", "optc": "Squirrel cage motor", "optd": "Synchronous motor", "ans": "C", "explanation": "The squirrel cage motor is the only one without any connection to the armature."}, {"question": "A given signal's second harmonic is twice the given signal's __________ frequency...?", "opta": "Fourier", "optb": "Foundation", "optc": "Fundamental", "optd": "Field", "ans": "C", "explanation": "A given signal's second harmonic is twice the given signal's fundamental frequency. Harmonics are generated when there are non-linearities in an amplifier (there are always non-linearities). The worse the non-linearities, the more harmonics. A signal at 27.5 MHz (approximate frequency for US citizen's band) would have a second harmonic at 55.0 MHz (on US channel 2!). Can you see why there might be problems? A CB operator might do well to place a low-pass filter on his radio."}, {"question": "In which year was MIDI(Musical Instrument Digital Interface) introduced?", "opta": "1987", "optb": "1983", "optc": "1973", "optd": "1977", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What does the term PLC stand for?", "opta": "Programmable Lift Computer", "optb": "Program List Control", "optc": "Programmable Logic Controller", "optd": "Piezo Lamp Connector", "ans": "C", "explanation": "Used in manufacturing, engineering, and process operations."}, {"question": "When measuring the characteristics of a small-signal amplifier, say for a radio receiver, one might be concerned with its \"Noise...\"?", "opta": "Fundamental", "optb": "Fall", "optc": "Force", "optd": "Figure", "ans": "D", "explanation": "\"Noise figure\" is one critical parameter for determining the \"quality\" of a low-noise, small-signal, amplifier, and perhaps more importantly, the sensitivity of the overall receiver system. It is especially important for VHF (very high frequency) - and higher frequency - designs where most of the undesired \"noise\" (noise that masks or overpowers the desired signals) is generated internal to the electronics itself. In HF (high frequency) applications, atmospheric noise plays a much larger role in determining overall useful sensitivity, so a circuit's \"noise figure\" is less important."}, {"question": "'DB' computer abbreviation usually means ?", "opta": "Database", "optb": "Double Byte", "optc": "Data Block", "optd": "Driver Boot", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "'.INI' extension refers usually to what kind of file?", "opta": "Image file", "optb": "System file", "optc": "Hypertext related file", "optd": "Image Color Matching Profile file", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The sampling rate, (how many samples per second are stored) for a CD is...?", "opta": "48.4 kHz", "optb": "22,050 Hz", "optc": "44.1 kHz", "optd": "48 kHz", "ans": "C", "explanation": "CDs reproduce 44,100 samples per second. Which has a maximum frequency reproduction of 22,050 Hz, or just a hair past the upper limit of human hearing. In this way CDs can theoretically reproduce any frequency in the human hearing range."}, {"question": "Who created Pretty Good Privacy (PGP)?", "opta": "Phil Zimmermann", "optb": "Tim Berners-Lee", "optc": "Marc Andreessen", "optd": "Ken Thompson", "ans": "A", "explanation": "Phil Zimmermann created the first version of PGP encryption in 1991. Pretty Good Privacy (PGP) is a data encryption and decryption computer program that provides cryptographic privacy and authentication for data communication. PGP is often used for signing, encrypting and decrypting texts, E-mails, files, directories and whole disk partitions to increase the security of e-mail communications."}, {"question": "What do we call a network whose elements may be separated by some distance? It usually involves two or more small networks and dedicated high-speed telephone lines.", "opta": "URL (Universal Resource Locator)", "optb": "LAN (Local Area Network)", "optc": "WAN (Wide Area Network)", "optd": "World Wide Web", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "After the first photons of light are produced, which process is responsible for amplification of the light?", "opta": "Blackbody radiation", "optb": "Stimulated emission", "optc": "Planck's radiation", "optd": "Einstein oscillation", "ans": "B", "explanation": "The word \"laser\" is actually an acronym for light amplification by stimulated emission of  radiation. Atoms or molecules of the active medium that have been excited to a higher energy level are stimulated by a passing photon to relax to a lower energy level and emit a photon that is indistinguishable from the passing photon, thereby increasing the number of photons like the incident one."}, {"question": "Which is NOT an acceptable method of distributing small power outlets throughout an open plan office area?", "opta": "Power Poles", "optb": "Power Skirting", "optc": "Flush Floor Ducting", "optd": "Extension Cords", "ans": "D", "explanation": "Extension cords can be a tripping hazard, and can be easily damaged, causing an unsafe situation. There are many ways of safely getting power to each work place, where wiring is protected and concealed."}, {"question": "Sometimes computers and cache registers in a foodmart are connected to a UPS system. What does UPS mean?", "opta": "United Parcel Service", "optb": "Uniform Product Support", "optc": "Under Paneling Storage", "optd": "Uninterruptable Power Supply", "ans": "D", "explanation": "An uninterruptable power supply (UPS) is a backup power supply, such as a battery, that provides emergency power in the event that power is lost from the main supply."}, {"question": "Who co-founded Hotmail in 1996 and then sold the company to Microsoft?", "opta": "Shawn Fanning", "optb": "Ada Byron Lovelace", "optc": "Sabeer Bhatia", "optd": "Ray Tomlinson", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "'.TMP' extension refers usually to what kind of file?", "opta": "Compressed Archive file", "optb": "Image file", "optc": "Temporary file", "optd": "Audio file", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "In the UK, what type of installation requires a fireman's switch?", "opta": "Neon Lighting", "optb": "High Pressure Sodium Lighting", "optc": "Water Features", "optd": "Hotel Rooms", "ans": "A", "explanation": "Neon lighting runs at a high voltage, typically above 1000 Volts. A fireman's switch protects a fireman from receiving a shock when a water jet is sprayed onto the installation. The switches are red, and mounted in a conspicuous position. (This is specified by IEE Regulations (Europe), SANS (South Africa), UK Electricity regulations and many Asian countries. I am unable to confirm other countries' requirements, so feel free to let me know.)"}, {"question": "The electromagnetic coils on the neck of the picture tube or tubes which pull the electron beam from side to side and up and down are called a...?", "opta": "Transformer", "optb": "Yoke", "optc": "Capacitor", "optd": "Diode", "ans": "B", "explanation": "Twisting the yoke will tilt the picture. A projection color television uses three picture tubes and yokes for red, green and blue light."}, {"question": "In the United States the television broadcast standard is...?", "opta": "PAL", "optb": "NTSC", "optc": "SECAM", "optd": "RGB", "ans": "B", "explanation": "PAL and SECAM are standards used in other countries. RGB stands for red, green, and blue - the colors of light used to create an image in a color tv set and is often used as a format name for computer monitors."}, {"question": "In a color television set using a picture tube a high voltage is used to accelerate electron beams to light the screen. That voltage is about...?", "opta": "500 volts", "optb": "5 thousand volts", "optc": "25 thousand volts", "optd": "100 thousand volts", "ans": "C", "explanation": "This voltage often remains in storage even if the set is unplugged. Although the voltage is very high it has very low power but it can be dangerous because your body jumps if brought in contact."}, {"question": "The transformer that develops the high voltage in a home television is commonly called a...?", "opta": "Tesla coil", "optb": "Flyback", "optc": "Yoke", "optd": "Van de Graaf", "ans": "B", "explanation": "The flyback is usually connected to the system that pulls the electron beam across the screen in one direction to 'paint' a line of the image and then returns in the other direction much faster."}, {"question": "Which consists of two plates separated by a dielectric and can store a charge?", "opta": "Inductor", "optb": "Capacitor", "optc": "Transistor", "optd": "Relay", "ans": "B", "explanation": "Useful in tuning and filtering circuits, it blocks DC while passing AC. How much charge a capacitor can store is its capacitance, measured in farads.nn"}, {"question": "What do we call a collection of two or more computers that are located within a limited distance of each other and that are connected to each other directly or indirectly?", "opta": "Inernet", "optb": "Interanet", "optc": "Local Area Network", "optd": "Wide Area Network", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "'.JPG' extension refers usually to what kind of file?", "opta": "System file", "optb": "Animation/movie file", "optc": "MS Encarta document", "optd": "Image file", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What does AM mean?", "opta": "Angelo marconi", "optb": "Anno median", "optc": "Amplitude modulation", "optd": "Amperes", "ans": "C", "explanation": "Amplitude modulation was the first type to be used in radio. It works well with HF and morse code."}, {"question": "In what year was the \"@\" chosen for its use in e-mail addresses?", "opta": "1976", "optb": "1972", "optc": "1980", "optd": "1984", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "'.TXT' extension refers usually to what kind of file?", "opta": "Text File", "optb": "Image file", "optc": "Audio file", "optd": "Adobe Acrobat file", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What was the first ARPANET message?", "opta": "\"lo\"", "optb": "\"hello world\"", "optc": "\"mary had a little lamb\"", "optd": "\"cyberspace, the final frontier\"", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The NTSC (National Television Standards Committee) is also used in the country of...?", "opta": "Japan", "optb": "France", "optc": "Germany", "optd": "England", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "\"FET\" is a type of transistor, Its full name is ________ Effect Transistor...?", "opta": "Field", "optb": "Factor", "optc": "Flash", "optd": "Force", "ans": "A", "explanation": "The terminals of FETs are called gate, drain and source. You might be more familiar with bipolar junction transistors (BJTs), which have terminals called base, collector and emitter. FETs were conceptualized first, but BJTs were easier to produce and so developed sooner."}, {"question": "What are three types of lasers?", "opta": "Gas, metal vapor, rock", "optb": "Pointer, diode, CD", "optc": "Diode, inverted, pointer", "optd": "Gas, solid state, diode", "ans": "D", "explanation": "The first laser was a solid state laser. Solid state refers to any solid material like a glass rod. Diode lasers are very common because they are used to read compact disks and digital video disks in computers, CD players, and DVD players. Before diode lasers, the most common type of laser may have been the helium-neon laser, in which the active medium is a combination of the two gasses helium and neon."}, {"question": "What will a UPS be used for in a building?", "opta": "To provide power to essential equipment", "optb": "To monitor building electricity use", "optc": "To carry messages between departments", "optd": "To control lighting and power systems", "ans": "A", "explanation": "UPS stands for Uninterruptible Power Supply. Examples of equipment that may require a UPS supply are computers, fire detection systems, hospital operating theatre equipment and escape route lighting."}, {"question": "Who built the world's first binary digit computer: Z1...?", "opta": "Konrad Zuse", "optb": "Ken Thompson", "optc": "Alan Turing", "optd": "George Boole", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Compact discs, (according to the original CD specifications) hold how many minutes of music?", "opta": "74 mins", "optb": "56 mins", "optc": "60 mins", "optd": "90 mins", "ans": "A", "explanation": "According to many stories surrounding the origin of the compact disc, 74 minutes was settled on because it would comfortably contain all of Beethoven's 9th symphony on one disc. Although some stories reference a specific Sony higher-up who claimed this as his favorite piece of music, stories differ. All that's known for sure is that Sony insisted on this and won out over Phillips' original 60 minute proposal."}, {"question": "Once the active medium is excited, the first photons of light are produced by which physical process?", "opta": "Blackbody radiation", "optb": "Spontaneous emission", "optc": "Synchrotron radiation", "optd": "Planck’s oscillation", "ans": "B", "explanation": "Spontaneous emission is what you see with most \"glow in the dark\" toys. You excite the toy by exposing it to bright light, then the toy glows in the dark by spontaneously emitting photons as the excited atoms relax back down to their normal state."}, {"question": "'DTP' computer abbreviation usually means ?", "opta": "Digital Transmission Protocol", "optb": "DeskTop Publishing", "optc": "Data Type Programming", "optd": "Document Type Processing", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The average power (in watts) used by a 20 to 25 inch home color television is...?", "opta": "70-100", "optb": "25-50", "optc": "500-800", "optd": "Over 1000", "ans": "A", "explanation": "About the same as as the most popular light bulb size."}, {"question": "What does AC and DC stand for in the electrical field?", "opta": "Alternating Current and Direct Current", "optb": "A Rock Band from Australia", "optc": "Average Current and Discharged Capacitor", "optd": "Atlantic City and District of Columbia", "ans": "A", "explanation": "Electricity is voltage and current. Voltage is electrical pressure, and current is the flow of charged particles. The difference between alternating current (AC) and direct current (DC) is that the electrons in an AC circuit regularly reverse their direction. In a DC circuit electrons always flow in the same direction."}, {"question": "In which decade was the ARRL founded?", "opta": "1940s", "optb": "1930s", "optc": "1920s", "optd": "1910s", "ans": "D", "explanation": "On April 6, 1914, Hiram Percy Maxim proposed the formation of the American Radio Relay League."}, {"question": "'CD' computer abbreviation usually means ?", "opta": "Command Description", "optb": "Change Data", "optc": "Copy Density", "optd": "Compact Disc", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "'.BAK' extension refers usually to what kind of file?", "opta": "Backup file", "optb": "Audio file", "optc": "Animation/movie file", "optd": "MS Encarta document", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Where is the headquarters of Intel located?", "opta": "Redmond, Washington", "optb": "Tucson, Arizona", "optc": "Santa Clara, California", "optd": "Richmond, Virginia", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Who co-created the UNIX operating system in 1969 with Dennis Ritchie?", "opta": "Bjarne Stroustrup", "optb": "Steve Wozniak", "optc": "Ken Thompson", "optd": "Niklaus Wirth", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Voltage is sometimes referred to as EMF, or Electromotive...?", "opta": "Field", "optb": "Factor", "optc": "Flash", "optd": "Force", "ans": "D", "explanation": "The term EMF, or Electromotive Force, its use now in decline, is attributed to Italian physicist Alessandro Volta (1745-1827). Today we generally use the term \"voltage\" - can you guess why we call it that?"}, {"question": "What does AM mean?", "opta": "Angelo marconi", "optb": "Anno median", "optc": "Amplitude modulation", "optd": "Amperes", "ans": "C", "explanation": "Amplitude modulation was the first type to be used in radio. It works well with HF and morse code."}, {"question": "'.BAT' extension refers usually to what kind of file?", "opta": "Compressed Archive file", "optb": "System file", "optc": "Audio file", "optd": "Backup file", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What is the term to ask the computer to put information in order numerically or alphabetically?", "opta": "Crop", "optb": "Report", "optc": "Record", "optd": "Sort", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The input used by an antenna or cable to a TV set uses frequencies called...?", "opta": "IF", "optb": "RF", "optc": "AF", "optd": "SAP", "ans": "B", "explanation": "RF is radio frequency. IF is intermediate frequency used inside the TV for processing. AF is audio frequency. SAP is second audio program which may have another language or other soundtrack as an option to the main soundtrack."}, {"question": "Larger buildings may be supplied with a medium voltage electricity supply, and will required a substation or mini-sub. What is the main item of equipment contained in these?", "opta": "Transformer", "optb": "Transponder", "optc": "Transducer", "optd": "Converter", "ans": "A", "explanation": "The transformer is used to transform a medium voltage supply to a low voltage supply, e.g. from 11 000 V to 400 V. A transformer is rated in kVA, kilo-Volt-Amps, which is a measurement of electrical power."}, {"question": "What was the active medium used in the first working laser ever constructed?", "opta": "A diamond block", "optb": "Helium-neon gas", "optc": "A ruby rod", "optd": "Carbon dioxide gas", "ans": "C", "explanation": "Theodore Maiman built the first working laser using a ruby rod while working at Hughes Research Laboratories in Malibu, California. It lased for the first time on May 16, 1960."}, {"question": "What does EPROM stand for?", "opta": "Electric Programmable Read Only Memory", "optb": "Erasable Programmable Read Only Memory", "optc": "Evaluable Philotic Random Optic Memory", "optd": "Every Person Requires One Mind", "ans": "B", "explanation": "A chip found in alomst every microprocessor..."}]]}