{"test_questions": [[{"question": "Who invented the BALLPOINT PEN?", "opta": "Biro Brothers", "optb": "Waterman Brothers", "optc": "Bicc Brothers", "optd": "Write Brothers", "ans": "A", "explanation": "The Hungarian brothers, Laszlo and George Biro, made the first ball point pen in 1894. It followed the first workable fountain pen which was invented by L.E. Waterman in 1884."}, {"question": "In which decade was the first solid state integrated circuit demonstrated?", "opta": "1950s", "optb": "1960s", "optc": "1970s", "optd": "1980s", "ans": "A", "explanation": "On September 12, 1958, Jack Kilby demonstrated the first working IC while working for Texas Instruments, although the U.S. patent office awarded the first patent for an integrated circuit to Robert Noyce of Fairchild."}, {"question": "What J. B. Dunlop invented?", "opta": "Pneumatic rubber tire", "optb": "Automobile wheel rim", "optc": "Rubber boot", "optd": "Model airplanes", "ans": "A", "explanation": "John Boyd Dunlop, a veterinary surgeon, invented the pneumatic tyre in 1887."}, {"question": "Which scientist discovered the radioactive element radium?", "opta": "Isaac Newton", "optb": "Albert Einstein", "optc": "Benjamin Franklin", "optd": "Marie Curie", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "When was barb wire patented?", "opta": "1874", "optb": "1840", "optc": "1895", "optd": "1900", "ans": "A", "explanation": "Joseph F. Glidden was born in New York on Jan. 18, 1812. He invented barbed wire in 1873 and was granted the patent on Nov. 24, 1874. After a three year battle over the patent, which he eventually won, Gidden became known as the \"Father of Barbed Wire\"."}, {"question": "What is the name of the CalTech seismologist who invented the scale used to measure the magnitude of earthquakes?", "opta": "Charles Richter", "optb": "Hiram Walker", "optc": "Giuseppe Mercalli", "optd": "Joshua Rumble", "ans": "A", "explanation": "Richter was born on an Ohio farm in 1900. He died in 1985."}, {"question": "What Galileo invented?", "opta": "Barometer", "optb": "Pendulum clock", "optc": "Microscope", "optd": "Thermometer", "ans": "D", "explanation": "Various authors have credited the invention of the thermometer to Cornelius Drebbel, Robert Fludd, Galileo Galilei or Santorio Santorio. The thermometer was not a single invention, however, but a development.\nGalileo Galilei also discovered that objects (glass spheres filled with aqueous alcohol) of slightly different densities would rise and fall, which is nowadays the principle of the Galileo thermometer (shown). Today such thermometers are calibrated to a temperature scale."}, {"question": "This statesman, politican, scholar, inventor, and one of early presidents of USA invented the swivel chair, the spherical sundial, the moldboard plow, and the cipher wheel.", "opta": "George Washington", "optb": "Alexander Hamilton", "optc": "John Adams", "optd": "Thomas Jefferson", "ans": "D", "explanation": "Thomas Jefferson (April 13, 1743 - July 4, 1826) was the third President of the United States (1801-1809) and the principal author of the Declaration of Independence (1776)."}, {"question": "What James Watt invented?", "opta": "Diving bell", "optb": "Steam boat", "optc": "Hot air balloon", "optd": "Rotary steam engine", "ans": "D", "explanation": "Invented in 1765."}, {"question": "Where is the village of Branston, after which the famous pickle is named?", "opta": "Yorkshire", "optb": "Lancashire", "optc": "Staffordshire", "optd": "Norfolk", "ans": "C", "explanation": "The village of Branston is in Staffordshire, just south of Burton-on-Trent."}, {"question": "Who invented Jet Engine?", "opta": "Sir Frank Whittle", "optb": "Gottlieb Daimler", "optc": "Roger Bacon", "optd": "Lewis E. Waterman", "ans": "A", "explanation": "Dr. Hans von Ohain and Sir Frank Whittle are recognized as the co-inventors of the jet engine. Each was working separately and knew nothing of the others work. Although Whittle started first, von Ohain was first to design and develop a turbojet engine to power an aircraft.\n\nOf the many honors received by both, the most significant honor was probably \"The Charles Draper Prize\" in 1992 which was given to both Hans von Ohain and Sir Frank Whittle for their efforts and contributions to aviation and mankind. \"The Charles Draper Prize\" is recognized as the equivalent to the Nobel Prize in technology."}, {"question": "What invention caused many deaths while testing it?", "opta": "Dynamite", "optb": "Ladders", "optc": "Race cars", "optd": "Parachute", "ans": "D", "explanation": "Many people who tried to test the first parachutes died by jumping from high places. One attempt was a parachute hat, but the inventor broke his neck while testing it. The first successful parachute was tested from a hot air balloon in 1797, in France, by Jacques Garnerin."}, {"question": "Who invented Gunpowder?", "opta": "G. Ferdinand Von Zeppelin", "optb": "Sir Frank Whittle", "optc": "Roger Bacon", "optd": "Leo H Baekeland", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Until Victorian times, chocolate was thought of as a drink. When did the first chocolate bar appear?", "opta": "1828", "optb": "1831", "optc": "1825", "optd": "There is no sure date", "ans": "D", "explanation": "No one knows for sure when the first chocolate bar appeared or even who made it, but an important event occurred in 1828. The Van Houten press was invented, which extracted cocoa butter from the bean - the same press that brought the Cadbury Brothers success with Cocoa Essence."}, {"question": "In which decade was the telephone invented?", "opta": "1850s", "optb": "1860s", "optc": "1870s", "optd": "1880s", "ans": "C", "explanation": "Alexander Graham Bell's notebook entry of 10 March 1876 describes his successful experiment with the telephone. Speaking through the instrument to his assistant, Thomas A. Watson, in the next room, Bell utters these famous first words, \"Mr. Watson -- come here -- I want to see you\"."}, {"question": "Who perfected GENETIC ENGINEERING?", "opta": "Cohen & Boyer", "optb": "Hunt & Davids", "optc": "Sinclair & Roberts", "optd": "Jaysson & Simons", "ans": "A", "explanation": "Genetic Engineering, the technique of DNA cloning was perfected by Stanley Cohen and Herbert Boyer in 1973."}, {"question": "What now-ubiquitous device was invented by Zenith engineer Eugene Polley in 1955?", "opta": "Microwave oven", "optb": "Remote control", "optc": "VCR", "optd": "Calculator", "ans": "B", "explanation": "The first wireless remote control for television was called Flashmatic. (Remember when you had to get up to change the channel?)"}, {"question": "What Benjamin Franklin invented?", "opta": "Bifocal spectacles", "optb": "Radio", "optc": "Barometer", "optd": "Hygrometer", "ans": "A", "explanation": "Invented in 1760.\n\nA list of Benjamin Franklin's inventions reveals a man of many talents and interests. It was the scientist in Ben that brought out the inventor. His natural curiosity about things and the way they work made him try to find ways to make them work better.\n\nBen had poor vision and needed glasses to read. He got tired of constantly taking them off and putting them back on, so he decided to figure out a way to make his glasses let him see both near and far. He had two pairs of spectacles cut in half and put half of each lens in a single frame. Today, we call them bifocals."}, {"question": "This part-time race car driver invented the bucket seat in 1969. Who was he??", "opta": "Steve McQueen", "optb": "Harrison Frazier", "optc": "Paul Newman", "optd": "John Wayne", "ans": "A", "explanation": "McQueen died in 1980 from a rare form of lung cancer."}, {"question": "What plaything was invented by Joe McVicker in 1956?", "opta": "Silly Putty", "optb": "Etch-A-Sketch", "optc": "Lite-Brite", "optd": "Play-Doh", "ans": "D", "explanation": "The stuff was originally intended to be wallpaper cleaner! (I used to eat this as a child)"}, {"question": "Who was the first American female to patent her invention, a method of weaving straw with silk?", "opta": "Marjorie Joyner", "optb": "Margaret Knight", "optc": "Amanda Jones", "optd": "Mary Kies", "ans": "D", "explanation": "Mary was not the first American woman inventor to be sure, there were many female inventors before her, but they never bothered to get a patent."}, {"question": "Who invented Gramophone?", "opta": "Michael Faraday", "optb": "Fahrenheit", "optc": "Sir Alexander Graham Bell", "optd": "Thomas Alva Edison", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Who invented Internal Combustion Engine?", "opta": "Roger Bacon", "optb": "Karl Benz", "optc": "Dr. Alan M. Turing", "optd": "Otto", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "When was Monopoly created?", "opta": "1940s", "optb": "1930s", "optc": "1920s", "optd": "1950s", "ans": "B", "explanation": "After the Stock Market crash, a buying and selling game created by Charles Darrow came to be. The first games were hand drawn on linoleum with streets from Atlantic City, N.J. as the property. He took the game to the Parker Brothers company, and Monopply was brought out for Christmas 1934. Everyone wanted to buy the games after Christmas, and Monopoly became a big success."}, {"question": "What furniture item was invented by California furniture designer Charles Prior Hall in 1968?", "opta": "Sofa bed", "optb": "Captain's chair", "optc": "Waterbed", "optd": "Hammock", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The Manhattan Project was started by President Roosevelt in 1942 to ensure that the U.S. beat the Germans in developing a nuclear bomb. Whom did Roosevelt appoint as scientific head the Manhattan Project?", "opta": "Robert Oppenheimer", "optb": "James B. Conant", "optc": "Leslie R. Groves", "optd": "Vannevar Bush", "ans": "A", "explanation": "Leslie R. Groves, however, was the military head of the project and the overall supremo, while Robert Oppenheimer was the scientific director. The world's first atomic bomb was exploded in the New Mexico desert on July 16, 1945."}, {"question": "When was the first lawn mower invented?", "opta": "1830", "optb": "1854", "optc": "1835", "optd": "1849", "ans": "A", "explanation": "The first lawn mowers were not engine powered. Invented in 1830 by Edwin Budding of England, the mowers were turning blades on wooden sticks used to cut grass. Engine powered mowers were not invented until 1919 by an American Army colonel, who used the motor from a washing machine."}, {"question": "In which decade were the first successful diode and triode vacuum tubes invented?", "opta": "1800s", "optb": "1880s", "optc": "1890s", "optd": "1900s", "ans": "D", "explanation": "In 1904, John Ambrose Fleming invented the first practical electron tube called the 'Fleming Valve', which is a diode rectifier. In 1906, Lee de Forest invented the audion later called the triode, which provided signal amplification."}, {"question": "Who is the English physicist responsible for the 'Big Bang Theory'?", "opta": "Albert Einstein", "optb": "Michael Skube", "optc": "George Gamow", "optd": "Roger Penrose", "ans": "C", "explanation": "George Gamow. Gamow, who died in 1968, was a physicist, who published \"Thirty Years that Shook Physics\"."}, {"question": "What 'game' was first produced by the Southern Novelty Company in Baltimore, Maryland in 1892?", "opta": "Frisbee", "optb": "Monopoly", "optc": "Ouija board", "optd": "Ping Pong", "ans": "C", "explanation": "The board was invented by Isaac and William Fuld. The word 'Ouija' comes from the French and German words for 'yes', 'oui' and 'ja'."}, {"question": "Who had an explosive idea and first patented DYNAMITE?", "opta": "J. R. Gluber", "optb": "A. Nobel", "optc": "G. Fawks", "optd": "W. Bickford", "ans": "B", "explanation": "Alfred Noble patented dynamite in 1876. Nobel left $9 million in his will to be used as awards for people whose work benefit humanity - The Nobel Peace Prize etc."}, {"question": "Who invented the Spinning Jenny?", "opta": "Thornton Hargreaves", "optb": "Peter Hargreaves", "optc": "James Hargreaves", "optd": "Simon Hargreaves", "ans": "C", "explanation": "Awarded a Patent in 1770. It used 8 bobbins at once."}, {"question": "Which insurance salesman invented the fountain pen in 1884?", "opta": "Lewis Edson Waterman", "optb": "Sir William Grove", "optc": "Charles Kettering", "optd": "George Fountain", "ans": "A", "explanation": "Lewis Edson Waterman patented the first practical fountain pen in 1884."}, {"question": "When was the first elevator built?", "opta": "1743", "optb": "1739", "optc": "1760", "optd": "1785", "ans": "A", "explanation": "The first elevator was built in the palace of King Louis XV. It only traveled up one floor, and was hand powered by men inside the chimney."}, {"question": "What charge card, developed in 1950, was the first to be accepted nationally in the US?", "opta": "Visa", "optb": "Discover", "optc": "MasterCharge", "optd": "Diner's Club", "ans": "D", "explanation": "The card was invented by Frank McNamara and Ralph Schneider."}, {"question": "What Enrico Fermi invented?", "opta": "X ray machine", "optb": "Betatron", "optc": "Cyclotron", "optd": "Nuclear reactor", "ans": "D", "explanation": "Invented in 1942."}, {"question": "Which of the following was first patented by an Australian in 1889?", "opta": "Electric Drill", "optb": "Electric Shaver", "optc": "Electric Fence", "optd": "Electric Heater", "ans": "A", "explanation": "The Electric Drill was the invention of Arthur James Arnot. On 20 August 1889 he patented his design while working for the Union Electric Company in Melbourne. His original design was meant primarily for drilling rock to find coal!"}, {"question": "Who among the following invented the small pox vaccine?", "opta": "Robert Koch", "optb": "Edward Jenner", "optc": "Robert Hooke", "optd": "Louis Pasteur", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What George Westinghouse invented?", "opta": "Light bulb", "optb": "Electric razor", "optc": "Refrigerator", "optd": "Railway air brakes", "ans": "D", "explanation": "Invented in 1868."}, {"question": "Who is the only U.S. President to invent and patent something?", "opta": "Abraham Lincoln", "optb": "Theodore Roosevelt", "optc": "Thomas Jefferson", "optd": "Rutherford B. Hayes", "ans": "A", "explanation": "In 1849 Honest Abe invented a method to aid ships that got stuck on sandbars. He called it A Device for Buoying Vessels Over Shoals. It was never used."}, {"question": "What invention is credited to the Russian born American inventor Vladimir Kosma Zworykin?", "opta": "Telegraph", "optb": "Radio", "optc": "Television", "optd": "Dishwasher", "ans": "C", "explanation": "Zworykin invented both the tube (iconoscope) for transmission and the receiver (kinescope) in 1923 and 1924, respectively."}, {"question": "Benjamin Franklin was a prolific inventor. He invented the lightning rod, the Franklin stove, studied electricity, discovered the Gulf Stream, started the first library, and on and on. Among his many other inventions, what musical instrument did he invent?", "opta": "Banjo", "optb": "Oboe", "optc": "Clarinet", "optd": "Harmonium", "ans": "D", "explanation": "Ben also holds a lot of firsts - first U.S. ambassador, first political cartoonist, first American philosopher, organized the first fire department, and on and on."}, {"question": "What Thomas Davenport invented?", "opta": "Screw propellor", "optb": "Electric streetcar", "optc": "Chesterfield", "optd": "Sleeping (railway) car", "ans": "B", "explanation": "Invented in 1834."}, {"question": "What Elisha Otis invented?", "opta": "The brake used in modern elevators", "optb": "Jet Engine", "optc": "Turbine", "optd": "Hydraulic Crane", "ans": "A", "explanation": "In 1853, American inventor Elisha Otis demonstrated a freight elevator equipped with a safety device to prevent falling in case a supporting cable should break. This increased public confidence in such devices. Otis established a company for manufacturing elevators and patented (1861) a steam elevator.\nMany people think that he invented the elevator, but the truth is, he invented the elevator brake. He also invented the railway safety brake."}, {"question": "Where was the yo-yo invented?", "opta": "France", "optb": "United States", "optc": "Philippines", "optd": "England", "ans": "C", "explanation": "The yo-yo was first used by hunters as weapons. They were wooden disks on strings. In the 1920s, a man from the U.S. named Donald Duncan made the yo-yo into a toy after he visited the Philippines."}, {"question": "For what does the world owe Almon Strowger a debt of gratitude?", "opta": "Parking Meters", "optb": "Vending Machines", "optc": "Automatic Telephone Exchanges", "optd": "Traffic Lights", "ans": "C", "explanation": "He was an undertaker, and legend has it, he developed the automatic switch in 1889, to stop competitors from getting his work!"}, {"question": "Who is often called the 'first African-American' inventor?", "opta": "Bessie Blount", "optb": "George Washington Carver", "optc": "Benjamin Banneker", "optd": "Elijah McCoy", "ans": "C", "explanation": "Banneker was a member of the planning committee that designed Washington, DC along with Pierre L'Enfant. When L'Enfant was fired Banneker recreated the plans from memory."}, {"question": "The first hand glider was designed by...?", "opta": "Leonardo DaVinci", "optb": "The Wright brothers", "optc": "Francis Rogallo", "optd": "Galileo", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "In which decade was the telegraph invented?", "opta": "1810s", "optb": "1840s", "optc": "1870s", "optd": "1890s", "ans": "B", "explanation": "On May 24, 1844, Samuel Morse send his famous message, \"What hath God wrought?\""}, {"question": "What inspired reflecting road lights to be invented?", "opta": "Car door reflecting mirrors", "optb": "The light a cat's eyes gave off on a fence", "optc": "Sun light on steel posts on road sides", "optd": "The sun light on the windshield", "ans": "B", "explanation": "In 1933, Englishman Percy Shaw was driving home when he saw a cat's eyes reflecting. He had been headed straight towards a fence with the cat on it, but on the other side was a drop of hundreds of feet."}, {"question": "When were blue jeans invented?", "opta": "1900s", "optb": "1860s", "optc": "1870s", "optd": "1850s", "ans": "D", "explanation": "The first blue jeans were invented by tailor Levi Strauss, who invented tougher working pants for the miners of the California Gold Rush."}, {"question": "Who invented Electric Generator?", "opta": "Sir Alexander Graham Bell", "optb": "Michael Faraday", "optc": "Alfred B. Nobel", "optd": "Thomas Alva Edison", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What device for new parents did Ann Moore invent in 1969?", "opta": "Bottle warmer", "optb": "Baby monitor", "optc": "Disposable diaper", "optd": "Infant carrier", "ans": "D", "explanation": "Ann got the idea for the Snugli infant carrier from the traditional African baby carriers she observed while a volunteer for the Peace Corps in Africa."}, {"question": "In which decade was the transistor invented?", "opta": "1940s", "optb": "1950s", "optc": "1960s", "optd": "1980s", "ans": "A", "explanation": "On December 23, 1947, William Shockley, Walter Brattain and John Bardeen, of Bell Labs, announced their discovery of the point-contact germanium transistor to management."}, {"question": "What Igor Sikorsky invented?", "opta": "Hydroplane", "optb": "Jet engine airplane", "optc": "Helicopter", "optd": "Glider", "ans": "C", "explanation": "Invented in 1939."}, {"question": "What Henry Bessemer invented?", "opta": "Aluminum", "optb": "Electroplating", "optc": "Steel Converter", "optd": "Steel rolling mill", "ans": "C", "explanation": "Invented in 1856."}, {"question": "What invention was first installed at a Hartford, Connecticut bank in 1889?", "opta": "Automatic teller machine", "optb": "Time-lock safe", "optc": "Burglar alarm", "optd": "Pay telephone", "ans": "D", "explanation": "William Gray, inventor of the pay telephone, also invented the inflatable chest protector worn by baseball umpires and catchers."}, {"question": "Ralph Samuelson was only 18 when he invented this sporting item in 1922. What was that?", "opta": "Golf tee", "optb": "Motorboat", "optc": "Water skis", "optd": "Hang glider", "ans": "C", "explanation": "The new item was first used on Lake Pepin in Minnesota."}, {"question": "Who invented Bifocal Lens?", "opta": "Alfred B. Nobel", "optb": "Thomas Alva Edison", "optc": "Benjamin Franklin", "optd": "Rudolf Diesel", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What Karl Benz invented?", "opta": "Gasoline powered automobile", "optb": "Streetcar", "optc": "Glider", "optd": "Steam turbine", "ans": "A", "explanation": "Invented in 1885."}, {"question": "When were bar code scanners invented?", "opta": "1940s", "optb": "1950s", "optc": "1970s", "optd": "1960s", "ans": "C", "explanation": "The scanner reads the bar code label on something at a supermarket, and translates it into a number which the computer reads."}, {"question": "When was the game Frisbee invented?", "opta": "1920s", "optb": "1900s", "optc": "1870s", "optd": "1890s", "ans": "C", "explanation": "The first Frisbees were pie tins from the Frisbie Pie Company in Connecticut. In the 1950s, the pie tins were changed to plastic plates. The name then became the Flying Saucer, but later changed to Frisbee."}, {"question": "This English inventor is known as the 'Father of Computing.'", "opta": "Philo Farnsworth", "optb": "J. Presper Eckert", "optc": "John Mauchly", "optd": "Charles Babbage", "ans": "D", "explanation": "Mauchly and Eckert invented the ENIAC computer. Farnsworth was a pioneer of early television."}, {"question": "Who invented Airship (rigid)?", "opta": "Dr. Alan M. Turing", "optb": "Roger Bacon", "optc": "G. Ferdinand Von Zeppelin", "optd": "Otto", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What piece of clothing was invented by French fashion designer Louis Reard in 1946?", "opta": "Zoot suit", "optb": "Mini-skirt", "optc": "Bikini", "optd": "Tank top", "ans": "C", "explanation": "The bikini, a two-piece swimsuit named for the Bikini Atoll in the Pacific, made its debut on July 5, 1946."}, {"question": "In which year was MIDI introduced?", "opta": "1987", "optb": "1983", "optc": "1973", "optd": "1977", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "In which decade was the SPICE simulator introduced?", "opta": "1950s", "optb": "1960s", "optc": "1970s", "optd": "1980s", "ans": "C", "explanation": "SPICE (Simulation Program with Integrated Circuit Emphasis) was introduced in May 1972 by the University of Berkeley, California."}, {"question": "Who invented the first controllable flying AEROPLANE (AIRPLANE)?", "opta": "Wright Brothers", "optb": "Lidenbergh Brothers", "optc": "South Brothers", "optd": "West Brothers", "ans": "A", "explanation": "Wilbur and Orville Wright made the first successful controlled powered flight at Kitty Hawk, North Carolina, in December 1903. The twelve second flight covered a distance of 120 feet and an altitude of just ten feet."}, {"question": "What groovy item was invented by Englishman Edward Craven Walker in 1963?", "opta": "Leisure suit", "optb": "Lava lamp", "optc": "Eight-track tape deck", "optd": "Hot comb", "ans": "B", "explanation": "Groovy, baby! Lava lamps, which were a fixture in every hip pad in the 1960s and 70s, featured a mixture of water and colored oil that created swirl patterns when heated by a light bulb."}, {"question": "In which decade was the Internet first implemented?", "opta": "1940s", "optb": "1950s", "optc": "1960s", "optd": "1980s", "ans": "C", "explanation": "The first message ever sent over what is now called the Internet took place at 10:30PM on October 29, 1969. Back then, the Department of Defense called it ARPAnet (Advanced Research Projects Agency network)."}, {"question": "What did cardiologist Dr. Paul Zoll invent in Massachusetts in 1952?", "opta": "EKG", "optb": "Artificial heart valve", "optc": "Artificial heart", "optd": "Pacemaker", "ans": "D", "explanation": "The pacemaker is an electrical device that regulates the heartbeat."}, {"question": "What Elmer A. Sperry invented?", "opta": "Hydroplane", "optb": "Hydraulic turbine", "optc": "Magnetic compass", "optd": "Gyrocompass", "ans": "D", "explanation": "Invented in 1911."}, {"question": "For over 500 years, paper was only available and sold as single sheets. In 1902, an inventive Australian used half size sheets of paper, a bit of glue and cardboard to create the what?", "opta": "Notepad", "optb": "Calendar", "optc": "Notice Board", "optd": "Telephone Book", "ans": "A", "explanation": "Birchall's of Launceston in Tasmania started selling the world’s first notepads, calling them 'Silvercity Writing Tablets' after J A Birchall thought it would be a good idea to back sheets of paper with cardboard and glue them together at the top. His British paper suppliers weren’t so keen, but, they were persuaded by Birchall that it was a good idea!"}, {"question": "Who developed the idea of Crop Rotation?", "opta": "Potato Peterson", "optb": "Turnip Townsend", "optc": "Cabbage Carlson", "optd": "Swede Svenson", "ans": "B", "explanation": "Viscount Charles 'Turnip' Townsend developed this revolutionary concept."}, {"question": "CORN FLAKES - Who made them first?", "opta": "Nabisco", "optb": "Kellogg", "optc": "Quaker", "optd": "Archers", "ans": "B", "explanation": "Will Keith Kellogg discovered the corn flake, by mistake, in 1906. They were the result of an experiment which went wrong."}, {"question": "William Frederick is credited with the invention of the modern frisbee in the mid 1950's. In 1957 the Wham-O Company bought his idea and the rest is history. They named the toy after William Frisbie who was a ________?", "opta": "Pie maker", "optb": "Owner of a pizza parlor", "optc": "Student at Yale", "optd": "Ceramic plate designer", "ans": "A", "explanation": "Frisbie made a brand of pies that were popular with Yale students in the 1870's. After eating the pies they would throw the pie tins through the air."}, {"question": "Who came up with the idea for INSTANT MASHED POTATO?", "opta": "S. Tuberosum", "optb": "W. Raleigh", "optc": "E. Asselbergs", "optd": "K. Edwards", "ans": "C", "explanation": "Instant mash was invented by Edward A Asselbergs, a Canadian, in 1962. The mash is actually dehydyated potato flakes."}, {"question": "Who invented Dynamite?", "opta": "Sir Alexander Graham Bell", "optb": "Benjamin Franklin", "optc": "Thomas Alva Edison", "optd": "Alfred B. Nobel", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What toy did George Lerner create for Hasbro company in 1952?", "opta": "Sit and Spin", "optb": "Talking baby doll", "optc": "Mr. Potato Head", "optd": "Hula hoop", "ans": "C", "explanation": "This was a plastic potato-shaped body on which you could stick different features, such as eyes, ears, etc."}, {"question": "For whom high heeled shoes were invented?", "opta": "Cleopatra", "optb": "Queen Elizabeth I", "optc": "King Louis the XIV", "optd": "King Charles II", "ans": "C", "explanation": "King Louis XIV was very short and didn't like looking up at people he spoke to, so he had a tall pair of shoes made for him."}, {"question": "What African-American inventor received 5 patents in the field of shoemaking?", "opta": "Elijah McCoy", "optb": "Jan Ernst Matzeliger", "optc": "Ernest Just", "optd": "Lewis Latimer", "ans": "B", "explanation": "Matzeliger never benefited financially from his inventions. He died in 1889 at the age of 37 from tuberculosis."}, {"question": "It travels over land and water. Who invented the HOVERCRAFT?", "opta": "S. Sperrow", "optb": "O. Stricheg", "optc": "T. Henman", "optd": "C. Cockerell", "ans": "D", "explanation": "Christopher Cockerell invented the hovercraft in 1956. His early experiments with the idea involved a cat food tin, a coffee tin and an industrial blower."}, {"question": "In which decade was the AEEE (now the IEEE) founded?", "opta": "1850s", "optb": "1880s", "optc": "1930s", "optd": "1950s", "ans": "B", "explanation": "The IEEE (Institute of Electrical and Electronics Engineers) was formed in 1963 by the merger of the Institute of Radio Engineers (IRE, founded 1912) and the American Institute of Electrical Engineers (AIEE, founded 1884)."}, {"question": "What type of system did  Paul Nipkow, John Baird, and Charles Jenkins all invent?", "opta": "Telephone", "optb": "Early Warning", "optc": "Electricity", "optd": "Television", "ans": "D", "explanation": "All of the inventors mentioned invented an early mechanical television system."}, {"question": "What Sir Isaac Newton invented?", "opta": "Reflecting telescope", "optb": "Chronometer", "optc": "Microscope", "optd": "Spectacles", "ans": "A", "explanation": "Invented in 1668."}, {"question": "Who invented Bicycle?", "opta": "Leo H Baekeland", "optb": "Karl Benz", "optc": "Evangelista Torricelli", "optd": "Kirkpatrick Macmillan", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "In which decade with the first transatlantic radio broadcast occur?", "opta": "1850s", "optb": "1860s", "optc": "1870s", "optd": "1900s", "ans": "D", "explanation": "On December 12, 1901, a radio transmission received by Guglielmo Marconi resulted in the first transmission of a transatlantic wireless signal (Morse Code) from Poldhu, Cornwall, to St. John's, Newfoundland."}, {"question": "In the 1700s, who would pay the postage fee for letters before the stamp was invented?", "opta": "The sender", "optb": "There was no fee", "optc": "The receiver of the letter", "optd": "The post office", "ans": "C", "explanation": "Later in 1840, Rowland Hill invented the stamp, which was paid for by the sender, not the receiver."}, {"question": "Who synthesized the first wholly artificial gene?", "opta": "Hargobind Khorana", "optb": "J.J. Thompson", "optc": "Benjamin Franklin", "optd": "Meghnad Saha", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "FROZEN FOOD - Who discovered the first practical method of freezing food?", "opta": "C. Birdseye", "optb": "F. Rozenosh", "optc": "G. Findus", "optd": "R. Scott", "ans": "A", "explanation": "In the 1920s Clarence Birdseye discovered that if food was flash-frozen under pressure, it would freeze without the formation of ice crystals."}, {"question": "When was the Raggedy Ann doll patented?", "opta": "1915", "optb": "1920", "optc": "1919", "optd": "1911", "ans": "A", "explanation": "Johnny Gruelle patented the Raggedy Ann doll in 1915. The Raggedy Andy doll and the Raggedy Ann books came later."}, {"question": "What Frank Whittle invented?", "opta": "Radar", "optb": "Ethyl gasoline", "optc": "Sonar", "optd": "Jet propulsion", "ans": "D", "explanation": "Invented in 1937."}, {"question": "When was the first Lionel trains manufactured?", "opta": "1920", "optb": "1890", "optc": "1901", "optd": "1944", "ans": "C", "explanation": "Joshua Lionel Cowen and Harry C. Grant started the Lionel Manufacturing Company on Sept. 5, 1900 in New York City. The first train, which was called the Electric Express, was manufactured in 1901 and was an open gondola propelled by a fan motor. As time has passed, the trains have been made in different colors and styles."}, {"question": "What item, originally called the 'Whirlwind', was invented by Ives McGaffey in 1869?", "opta": "Blender", "optb": "Electric mixer", "optc": "Washing machine", "optd": "Vacuum cleaner", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What office item was invented by Bette Nesmith Graham in 1951?", "opta": "Fax machine", "optb": "Stapler", "optc": "Liquid Paper", "optd": "Copy machine", "ans": "C", "explanation": "Bette's other claim to fame was being the mother of Michael Nesmith of the Monkees."}, {"question": "What George Pullman invented?", "opta": "Sleeping (railway) car", "optb": "Airship", "optc": "Box car (railway)", "optd": "Air brakes", "ans": "A", "explanation": "Invented in 1857."}, {"question": "Who invented Bakelite?", "opta": "Charles Goodyear", "optb": "Leo Hendrik Baekeland", "optc": "Roy Plunkett", "optd": "Henry Ford", "ans": "B", "explanation": "Leo Hendrik Baekeland invented the first plastic called Bakelite."}, {"question": "What toy was invented by Joshua Lionel Cowen around 1900?", "opta": "Raggedy Ann doll", "optb": "Yo-yo", "optc": "Electric train", "optd": "Tinkertoys", "ans": "C", "explanation": "His middle name, Lionel, is the source of the Lionel Train brand name."}, {"question": "This African-American woman physical therapist worked with soldiers disabled in World War II. She invented a device that helped the disabled to eat by delivering food through a tube to a mouthpiece.", "opta": "Bessie Blount", "optb": "Marjorie Joyner", "optc": "Mae Jamison", "optd": "Beulah Henry", "ans": "A", "explanation": "Unfortunately Blount could never get anyone to buy her invention. Finally, in 1952 she sold the rights to the French government."}, {"question": "What invention by Garnet Carter made its debut at the Fairyland Inn Resort in Lookout Mountain, Tennessee, in 1927?", "opta": "Miniature golf", "optb": "Swimming pool slide", "optc": "Ski lift", "optd": "Golf cart", "ans": "A", "explanation": "It was originally called 'Tom Thumb Golf'."}, {"question": "Who invented the phonograph?", "opta": "Thomas Edison", "optb": "John Kruesi", "optc": "Jules Levy", "optd": "Alexander Graham Bell", "ans": "B", "explanation": "John Kruesi was a mechanic for Edison, and Kruesi built the phonograph. Edison designed it, and later improved the phonograph."}, {"question": "What beverage was invented by Charles Alderton in 1885 in Waco, Texas?", "opta": "Cream soda", "optb": "Coca-Cola", "optc": "Dr. Pepper", "optd": "Sprite", "ans": "C", "explanation": "The cherry-flavored cola made its debut at Morrison's Old Corner Drugstore."}, {"question": "Who invented fuel cells in 1839?", "opta": "Buckminster Fuller", "optb": "Sir William Grove", "optc": "Sylvester Graham", "optd": "Joyce Hall", "ans": "B", "explanation": "Fuel cells were invented in 1839 by Sir William Grove."}, {"question": "The ELECTRIC BATTERY, who's charged with inventing this one?", "opta": "Hertz", "optb": "Amper", "optc": "Galvani", "optd": "Volta", "ans": "D", "explanation": "Italian, Alessandro Volta discovered the first practical battery in 1800. Life would be very different without batteries."}, {"question": "In which decade was the ARRL founded?", "opta": "1940s", "optb": "1930s", "optc": "1920s", "optd": "1910s", "ans": "D", "explanation": "On April 6, 1914, Hiram Percy Maxim proposed the formation of the American Radio Relay League."}, {"question": "Who invented the Seed Drill?", "opta": "Jethro Tull", "optb": "Arlo Guthrie", "optc": "Woodie Guthrie", "optd": "Thomas Hines", "ans": "A", "explanation": "It was invented around the early 1700's."}, {"question": "What drink was invented by Charles Leiper Grigg in 1929?", "opta": "7-Up", "optb": "Yoo-Hoo", "optc": "Pepsi", "optd": "Hawaiian Punch", "ans": "A", "explanation": "Grigg, who was from Missouri, originally named his creation 'Bib-Label Lithiated Lemon-Lime Soda'."}, {"question": "For what is Charles Babbage (1792-1871) remembered?", "opta": "Computers", "optb": "Telescopes", "optc": "Radio-Telegraphy", "optd": "Steam Boating", "ans": "A", "explanation": "Know as the Father of Computing. He began his 'Analytical Engine' in 1833. The first computer, although he never completed it."}, {"question": "Who invented Automobiles using gasoline?", "opta": "Leo H Baekeland", "optb": "Karl Benz", "optc": "Evangelista Torricelli", "optd": "Kirkpatrick Macmillan", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Who invented the battery?", "opta": "John Wilkinson", "optb": "Alessandro Volta", "optc": "James Hargreaves", "optd": "Thomas Edison", "ans": "B", "explanation": "He was an Italian scientist, and he invented the battery in 1800."}, {"question": "Where were wigs first invented?", "opta": "Japan", "optb": "France", "optc": "Egypt", "optd": "China", "ans": "C", "explanation": "As you have noticed in pictures, many Egyptians have head coverings, sometimes with beads in them. The first wigs were created to cover the head from the hot sun."}, {"question": "Who was the first person to patent the JET ENGINE?", "opta": "F. Whittle", "optb": "C. Lindbergh", "optc": "W. Histell", "optd": "B. Owings", "ans": "A", "explanation": "British inventor Frank Whittle was the first to patent his design for a jet engine in 1930. Although an engine designed by Dr. Hans Von Ohain was the first to fly in 1939. Whittle's jet engine first flew in 1941."}, {"question": "The initials JCB on earth-moving equipment are those of the founder of the company that makes it. What is his name?", "opta": "John Christopher Ballantyne", "optb": "Joseph Cyril Bamford", "optc": "John Christopher Baxter", "optd": "Jack Croxford Baker", "ans": "B", "explanation": "Joseph Cyril Bamford founded the company that makes these iconic machines in 1945, in a 12ft X 15ft garage in Staffordshire."}, {"question": "What treat was invented by 11-year-old Frank Epperson in 1905?", "opta": "Popsicle", "optb": "Banana split", "optc": "Cotton candy", "optd": "Cracker Jacks", "ans": "A", "explanation": "It was originally called the 'Epsicle' in his honor. (I can see why that name didn't catch on)."}, {"question": "When was Milk Tray first introduced?", "opta": "1915", "optb": "1934", "optc": "1923", "optd": "1942", "ans": "A", "explanation": "Milk Tray was introduced in 1915 in open boxes arranged on wooden trays. Today, with its distinctive purple and gold cartons and popularised by the \"Man in Black\" television adverts, its one of the most popular chocolate assortments."}, {"question": "When was the toothbrush invented?", "opta": "1770", "optb": "1765", "optc": "1790", "optd": "1742", "ans": "A", "explanation": "The first toothbrush was made out of a bone and small brush, by jail prisoner William Addis of England."}, {"question": "What item of apparel was invented by Ellery Chun, a Hawaiian clothing merchant, in 1931?", "opta": "String bikini", "optb": "Muumuu", "optc": "Aloha shirt", "optd": "Capri pants", "ans": "C", "explanation": "An Aloha shirt is a brightly colored tropical print shirt that is a popular souvenir of Hawaii."}, {"question": "Who invented Fountain Pen?", "opta": "John J. Loud", "optb": "Sir Frank Whittle", "optc": "Lewis E. Waterman", "optd": "Kirkpatrick Macmillan", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}]]}