{"test_questions": [[{"question": "Which statement below best describes the function of a decoder?", "opta": "A decoder will convert a decimal number into the proper binary equivalent.", "optb": "A decoder will convert a binary number into a specific output representing a particular character or digit.", "optc": "Decoders are used to prevent improper operation of digital systems.", "optd": "Decoders are special ICs that are used to make it possible for one brand of computer to talk to another.", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "One can safely state that the output lines for a demultiplexer are under the direct control of the:", "opta": "input data select lines.", "optb": "the internal AND gates.", "optc": "the internal OR gate.", "optd": "Input data line.", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Refer to the figure given below. The logic function generator being implemented with the multiplexer in this circuit produces a constant LOW on the output. The ABC inputs are checked and appear to be pulsing; also, the 0–7 and EN inputs are checked with the scope and all appear to be at 0 V. A check with the DMM confirms that power is on. What is the problem, and what should be done to correct it?", "opta": "The output is shorted to Vcc; replace the IC.", "optb": "The scope's vertical input is in the AC mode and the common connection for the 0,2,3 and 5 inputs is bad. Set the scope's vertical input mode to DC, and repair the bad solder connection.", "optc": "Power has not been applied to the circuit; apply power.", "optd": "The output is shorted to ground; replace the IC.", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Refer to the keyboard encoder in figure (a). Sometimes when the 5 key is pressed, the system attached to the keypad does not respond. The 5 input on the 74147 is monitored with a digital storage scope while repeatedly pressing the 5 key, and the waveform in figure (b) is obtained; the P above the trace indicates the points at which the technician pressed the key. What is most likely wrong with the circuit?", "opta": "The switches on the 5 key are intermittent; the contacts need to be cleaned or the switch replaced.", "optb": "The pull-up resistor connected to the 5 key is bad and should be replaced.", "optc": "The common ground connection at the bottom of the 0 key has a bad solder connection; repair the connection.", "optd": "The 74147 is intermittent, possibly due to high temperature, and should be replaced.", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The BCD/DEC decoder shown in figure (a) is examined with a logic analyzer and the results are shown in the waveforms in figure (b). What, if anything, is wrong with the circuit?", "opta": "The \"2\" output is shorted to Vcc.", "optb": "The A1 input is internally open.", "optc": "The A1 input node is internally stuck LOW.", "optd": "Nothing is wrong with the circuit.", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "A 16-input multiplexer is to be used to perform parallel-to-serial data conversion. Which of the following counters would be required to provide the data select inputs?", "opta": "MOD 8", "optb": "MOD 16", "optc": "MOD 4", "optd": "MOD 2", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "A breadboard-circuit design using a BCD-to-decimal decoder has a problem wherein the operation of the system is erratic. The technician uses his scope to examine the waveforms throughout the system and doesn't really see any problems. While he's scratching his head, what helpful advice can you offer him as to what might be wrong and what to do to correct the problem?", "opta": "The decoder is thermally intermittent; replace it.", "optb": "There is probably a bad connection on the wire wrap protoboard; recheck the wiring.", "optc": "Glitches are probably the culprit; strobe the decoder.", "optd": "The decoder is thermally intermittent and must be replaced; or there is probably a bad connection on the wire wrap protoboard, and the wiring must be rechecked.", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Output 5 of a 74138 octal decoder is selected when it is enabled by a data input of:", "opta": "", "optb": "", "optc": "", "optd": "", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "How is the number one (1) indicated on the outputs of a 7447 BCD-to-seven-segment code converter?", "opta": "Segment a is active.", "optb": "Segment b is active.", "optc": "Segments a and b are active.", "optd": "Segments b and c are active.", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "For the input values (A0–A3, B0–B3, Data Select = 1) given for the circuit  given below, what will be indicated on the displays?", "opta": "A = 0, B = 5", "optb": "A = 5, B = 0", "optc": "A = 6, B = 0", "optd": "A = 0, B = 6", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "It is suspected that the comparator in the figure given below has a problem. The inputs are activated in the table shown below and the corresponding outputs noted. What is most likely wrong with the circuit? For P0 – P3 = 1 and Q0 – Q3 = 0, P > Q = 1, P = Q = 1, P < Q = 0 For P0 – P3 = 0 and Q0 – Q3 = 1, P > Q = 0, P = Q = 1, P < Q = 1 For P0 – P3 = 1 and Q0 – Q3 = 1, P > Q = 0, P = Q = 1, P < Q = 0", "opta": "The P0–P3 inputs are defective.", "optb": "One or more of the Q inputs is bad.", "optc": "The P = Q output is shorted to Vcc.", "optd": "Nothing is wrong; the circuit is functioning properly.", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Which statement best describes the given figure, and what is the function of the terminal labeled EN?", "opta": "Quad two-input multiplexer. EN is the enable input, which requires an active LOW for the device to work.", "optb": "Quad two-bit multiplier, EN is the active HIGH trigger.", "optc": "Dual quad-input multiplexer, which requires an active LOW on the EN terminal for the device to work.", "optd": "Quad two-input AND gate, which requires an active LOW on the EN input to enable all the gates.", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The data transmission system shown in below has a problem; the parity error output is always high. A logic analyzer is used to examine the system and shows that the DATA IN on the left matches the DATA OUT on right. What might be causing the problem?", "opta": "The error gate could be defective.", "optb": "The storage circuit could be defective.", "optc": "The parity checker could be bad.", "optd": "Any of the above.", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The IEEE/ANSI symbol for a decoder has the internal designation bcd/dec. This means the decoder is a:", "opta": "decimal-to-BCD decoder with ten inputs and four outputs.", "optb": "BCD-to-decimal decoder with ten inputs and four outputs.", "optc": "decimal-to-BCD decoder with four inputs and ten outputs.", "optd": "BCD-to-decimal decoder with four inputs and ten outputs.", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Multiplexing of digital signals is usually required when:", "opta": "moving data internally within a microprocessor.", "optb": "moving data between memory and storage registers in a microprocessor.", "optc": "moving data over long distance transmission lines.", "optd": "moving data internally within a microprocessor or between memory and storage registers.", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Referring to the figure given below, what output code will appear on the output (A3,A2,A1,A0) when the 5 key is pressed?", "opta": "1010", "optb": "0101", "optc": "1101", "optd": "1011", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What type of device is shown in the given figure, and what inputs (A3,A2,A1,A0) are required to produce the output levels as shown?", "opta": "A binary-to-decimal encoder; 0,1,1,1", "optb": "A decimal-to-binary decoder; 1,1,1,0", "optc": "A BCD-to-decimal decoder; 0,1,1,1", "optd": "A decimal-to-BCD encoder; 1,1,1,0", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What are the outputs of a 7485 four-bit magnitude comparator when the inputs are A = 1001 and B = 1010?", "opta": "A < B is 1 A = B is 0 A > B is 1", "optb": "A < B is 0 A = B is 1 A > B is 0", "optc": "A < B is 0 A = B is 0 A > B is 1", "optd": "A < B is 1 A = B is 0 A > B is 0", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Determine the correct output for the multiplexer and its associated timing diagram given below.", "opta": "Ya", "optb": "Yb", "optc": "Yc", "optd": "Yd", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Which is the decimal number for the BCD number, 10110110?", "opta": "182", "optb": "36", "optc": "116", "optd": "10110110 is not a valid BCD number.", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "In an AHDL BCD to binary code converter, how is multiplication by 10 accomplished?", "opta": "By using the shifting of bits", "optb": "By using the library multiplication function", "optc": "By using integer types", "optd": "By using the multiplication operator", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What is the HDL key issue in the design of the MUX and DEMUX?", "opta": "Having the MUX and DEMUX part of the library", "optb": "Using the case statement in the process", "optc": "Describing the functions", "optd": "Assigning signals under certain conditions", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Why are control inputs included in an HDL magnitude comparator?", "opta": "For cascading the chips", "optb": "For control signal input", "optc": "For signal control", "optd": "For internal interconnections", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What VHDL techniques are used to describe a priority encoder?", "opta": "Integer outputs and priority coding", "optb": "Signal outputs and priority coding", "optc": "Tristate outputs and priority coding", "optd": "Variables and priority coding", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What is an important attribute of the conditional signal assignment statement?", "opta": "Its tristate outputs", "optb": "Its sequential evaluation", "optc": "Its use of library components", "optd": "Its fast activation times", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "There appears to be a problem with a 7-segment display on a DMM sometimes skipping certain numbers. How would you test the display?", "opta": "Remove the display unit and check each segment diode with an ohmmeter. Replace the defective segments.", "optb": "Apply 5 V directly to each segment of the display and check for individual segment operation. Replace any segment that has voltage applied but is not lit.", "optc": "Tie all of the segments together and connect to Vcc; the number 8 should appear on the display. Now check the display supply voltage to determine if the display is receiving the correct voltage.", "optd": "Connect the DMM to a variable supply and very slowly increase the voltage, while observing for missing digits. Then check the segment voltage to determine whether the display or the display driver is bad.", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What is the purpose of a decoder's inputs?", "opta": "To allow the decoder to respond to the inputs to activate the correct output gate.", "optb": "To disable the decoder outputs so that all outputs will be inactive.", "optc": "To disable the inputs and activate all outputs.", "optd": "To allow the decoder to respond to the inputs to activate the correct output gate, and to disable the inputs and activate all outputs.", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Refer to the display multiplexer given below. The MSD display is blank, while the LSD seems to be OK. The input and output lines to the 74157 and 7449 are checked with a scope and can be seen changing levels. The A input on the 74139 also changes; however, the 0 output on the 74139 is always LOW and the 1 output is always HIGH. The B and EN inputs on the 74139 are always LOW. What could cause the problem and what should be done to correct it?", "opta": "The 74139 is defective; replace it.", "optb": "The EN pin on the 74139 could have a bad connection; check the connection.", "optc": "The 74139 is defective and must be replaced; or the EN pin on the 74139 could have a bad connection, which should be checked.", "optd": "The MSD display is bad; replace it.", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The circuit in Figure 9-8 is defective; data is not appearing on the output lines. A check with the scope shows data pulses on the serial data line and multiplex control lines, S0–S2; no parity error is indicated. A further check with a logic probe indicates that Vcc and ground appear to be present. What might be wrong with the circuit?", "opta": "The demultiplexer may be bad.", "optb": "The parity checker is defective.", "optc": "The parity generator may be bad.", "optd": "The parity checker is defective, or the parity generator may be bad.", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "What must be done in the given figure in order to use two 7485 4-bit comparators to compare two 8-bit numbers?", "opta": "The P < Q, P = Q, and P > Q outputs of COMP A must be connected to the same outputs of COMP B.", "optb": "The P < Q, P = Q, and P > Q outputs of COMP A must be connected to the <, =, and > inputs of COMP B.", "optc": "The = input of COMP A must be connected to Vcc, and the < and > inputs must be connected to ground.", "optd": "The P < Q, P = Q, and P > Q outputs of COMP A must be connected to the <, =, and > inputs of COMP B, the = input of COMP A must be connected to Vcc, and the < and > inputs must be connected to ground.", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}]]}