{"test_questions": [[{"question": "During the unfolding reaction of a helix, breakage of each hydrogen bond requires about 2kJ/mol. This implies hydrogen bonds are", "opta": "much stronger in proteins than in water", "optb": "not reformed with water", "optc": "slightly weaker in proteins than in water", "optd": "slightly stronger in proteins than in water", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "If the enthalpy change for a reaction is zero, ΔG° is equal to", "opta": "TΔS°", "optb": "-TΔS°", "optc": "-ΔH°", "optd": "lnKeq", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Reactions that have positive standard free energy changes (ΔGo> 0) can be made to occur in cells by", "opta": "coupling them with exergonic reactions via a common intermediate", "optb": "manipulating the concentrations of products and reactants such that G/<0", "optc": "coupling them to the hydrolysis of ATP", "optd": "all of the above", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The Standard Gibb's free energy, ΔG°, is", "opta": "the residual energy present in the reactants at equilibrium", "optb": "the residual energy present in the products at equilibrium", "optc": "the difference in the residual energy of reactants and products at equilibrium", "optd": "the energy required to convert one mole of reactants to one mole of products", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "If the Standard Gibb's free energy, ΔG°, for a reaction is positive then", "opta": "the products will be favored", "optb": "the reactants will be favored", "optc": "the concentration of the reactants and products will be equal", "optd": "all of the reactant will be converted to product", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "The unfolding of regular secondary structure causes", "opta": "little increase in the entropy of protein", "optb": "large decrease in the entropy of the protein", "optc": "no change in the entropy of the protein", "optd": "large increase in the entropy of the protein", "ans": "D", "explanation": "No answer description available for this question. Let us discuss."}]]}