{"test_questions": [[{"question": "What is the relationship between wavelength and wave number?", "opta": "Wavenumber = 1 / wavelength in centimeters", "optb": "Wavenumber - wavelength in nanometers = 1", "optc": "Wavelength in nanometers x wavenumber = 1", "optd": "None of the above", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "In the intersystem crossing", "opta": "the spin of an excited electron reverses, changing the state of the molecule (from singlet state to triplet state or vice versa)", "optb": "a molecule converts its excess energy to light, and emits a photon", "optc": "a molecule converts excess electronic energy to vibrational energy", "optd": "all of the above", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Why must the radiation source for fluorescence spectrometry be more powerful than for absorption spectroscopy?", "opta": "Because the magnitude of the output signal is proportional to the power of the incident radiation", "optb": "Because the sample won't fluoresce if the incident radiation is of low power", "optc": "To allow for scattering by the sample", "optd": "None of the above", "ans": "A", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Why do fluorescence spectrometers often use double-beam optics?", "opta": "So a reference solution can be used", "optb": "To compensate for beam attenuation by the monochromator", "optc": "To compensate for power fluctuations in the radiation source", "optd": "All of the above", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "For a molecule to absorb IR, why must the molecule's vibrations cause fluctuations in the dipole moment of the molecule?", "opta": "Because a change in dipole moment lowers the energy required for electronic transitions", "optb": "Because for absorption to occur, the radiation must interact with the electric field caused by changing dipole moment", "optc": "Because fluctuations in the dipole moment allow the molecule to deform by bending and stretching", "optd": "All of the above", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Internal conversion is where", "opta": "the spin of an excited electron reverses, changing the state of the molecule (from singlet state to triplet state or vice versa)", "optb": "A molecule converts its excess energy to light, and emits a photon", "optc": "A molecule converts excess electronic energy to vibrational energy", "optd": "none of the above", "ans": "C", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Why phosphorescence measurements are usually made at a low temperature?", "opta": "To prevent thermal degradation of the phosphorescent species", "optb": "To promote phosphorescence by slowing the rate of radiationless transfer processes", "optc": "To increase the efficiency of the detector", "optd": "To decease the efficiency of detector", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}, {"question": "Fluorescence occurs when", "opta": "a molecule returns to the electronic ground state from an excited triplet state by losing it's excess energy as a photon", "optb": "a molecule returns to the electronic ground state from an excited singlet state by losing it's excess energy as a photon", "optc": "a molecule lowers its vibrational energy by losing it's excess energy as a photon", "optd": "none of the above", "ans": "B", "explanation": "No answer description available for this question. Let us discuss."}]]}